from aiogram.types import ReplyKeyboardMarkup, KeyboardButton
from aiogram.utils.keyboard import ReplyKeyboardBuilder
from loader import db

HUDUDLAR = ["Navoiy shahri", "Karmana tumani", "Konimex tumani", "Navbahor tumani", "Nurota tumani", "Qiziltepa tumani", "Tomdi tumani", "Uchquduq tumani", "Xatirchi tumani-1", "Xatirchi tumani-2", "Zarafshon shahri", "Gʻazgʻon tumani"]

hudud_button_builder = ReplyKeyboardBuilder()
for hudud in HUDUDLAR:
    hudud_button_builder.add(KeyboardButton(text=hudud))
hudud_button_builder.adjust(2)

hududlar_button = hudud_button_builder.as_markup(input_field_placeholder="Hududni tanlang", resize_keyboard=True)

def mahalla_button(list_mahalla):
    button_builder = ReplyKeyboardBuilder()
    
    if isinstance(list_mahalla, list):
        for hudud in list_mahalla:
            if isinstance(hudud, dict):
                hudud_name = hudud.get('mahalla', hudud.get('neighborhood', hudud.get('MFY', '')))
            else:
                hudud_name = str(hudud)
            button_builder.add(KeyboardButton(text=hudud_name))
    else:
        list_mahalla = list_mahalla.keys()
        for hudud in list_mahalla:
            button_builder.add(KeyboardButton(text=str(hudud)))
    
    button_builder.adjust(2)
    button_builder.add(KeyboardButton(text='⬅️ Ortga'))
    return button_builder.as_markup(input_field_placeholder="Mahallani tanlang", resize_keyboard=True)

def mahalla_button_admin(list_mahalla):
    button_builder = ReplyKeyboardBuilder()
    
    if isinstance(list_mahalla, list):
        for hudud in list_mahalla:
            if isinstance(hudud, dict):
                hudud_name = hudud.get('mahalla', hudud.get('neighborhood', hudud.get('MFY', '')))
            else:
                hudud_name = str(hudud)
            button_builder.add(KeyboardButton(text=hudud_name))
    else:
        list_mahalla = list_mahalla.keys()
        for hudud in list_mahalla:
            button_builder.add(KeyboardButton(text=str(hudud)))
    
    button_builder.adjust(2)
    return button_builder.as_markup(input_field_placeholder="Mahallani tanlang", resize_keyboard=True)

def generate_candidates_keyboard(candidates, page, total_pages):
    keyboard = ReplyKeyboardMarkup(resize_keyboard=True)
    
    for candidate in candidates:
        button_text = f"{candidate[2]} ({candidate[3]}, {candidate[4]}, {candidate[5]})"
        keyboard.add(KeyboardButton(button_text))

    navigation_buttons = []
    if page > 1:
        navigation_buttons.append(KeyboardButton("Previous"))
    if page < total_pages:
        navigation_buttons.append(KeyboardButton("Next"))

    if navigation_buttons:
        keyboard.add(*navigation_buttons)

    return keyboard

def create_candidate_reply_markup(candidates):
    keyboard = ReplyKeyboardBuilder()

    if isinstance(candidates, list):
        for candidate in candidates:
            button_text = f"{candidate[2]}"
            keyboard.add(KeyboardButton(text=str(button_text)))
    else:
        print("ERROR create_candidate_reply_markup: Candidates should be a list")

    keyboard.adjust(2)
    keyboard.add(KeyboardButton(text='⬅️ Ortga'))
    return keyboard.as_markup(input_field_placeholder="Mahallani tanlang", resize_keyboard=True)

def create_kinder_school_reply_markup(kinder_schools):
    keyboard = ReplyKeyboardBuilder()

    if isinstance(kinder_schools, list):
        for ks in kinder_schools:
            if isinstance(ks, tuple) and len(ks) > 0:
                keyboard.add(KeyboardButton(text=str(ks[0])))
    else:
        print("ERROR create_kinder_school_reply_markup: Kinder schools should be a list")

    keyboard.adjust(2)
    keyboard.add(KeyboardButton(text='⬅️ Ortga'))
    return keyboard.as_markup(resize_keyboard=True)

navoiy_shahar = {
    'Жанубий МФЙ': {
        'Ф.И.Ш': 'Йўлдошев Воҳиджон Сайфуллоевич',
        'туғилган йил': 1972,
        'туғилган жойи': 'Бухоро вилояти, Ғиждувон тумани',
        'миллати': 'Ўзбек',
        'маълумоти': 'Олий',
        'мутахассислиги': 'Миллий мактабларда рус тили ва адабиёти фани ўқитувчиси',
        'маълумот олинган йил': 1994,
        'маълумот олинган жой': 'Жаҳон тиллар Университети',
        'аҳоли сони': 3322,
        'хонадон сони': 828,
        'оила сони': 852,
        'телефон рақам': '97-228-77-72'
    },
    'Лочин МФЙ': {
        'Ф.И.Ш': 'Махкамов Якуб Беркбоевич',
        'туғилган йил': 1978,
        'туғилган жойи': 'Навоий вилояти, Навоий шаҳар',
        'миллати': 'Ўзбек',
        'маълумоти': 'Олий',
        'мутахассислиги': 'ИИБ ходими',
        'маълумот олинган йил': 2002,
        'маълумот олинган жой': 'Ички ишлар вазирлиги академияси',
        'аҳоли сони': 4271,
        'хонадон сони': 1496,
        'оила сони': 1623,
        'телефон рақам': '99-759-09-23'
    },
    'Янгиариқ МФЙ': {
        'Ф.И.Ш': 'Мавланов Абусаид Нирсаитович',
        'туғилган йил': 1981,
        'туғилган жойи': 'Навоий вилояти, Навоий шаҳри',
        'миллати': 'Ўзбек',
        'маълумоти': 'Тугалланмаган олий',
        'мутахассислиги': 'педагогика ва психология таълим йўналиши',
        'маълумот олинган йил': 2022,
        'маълумот олинган жой': 'PROFI UNIVERSITY хусусий университети',
        'аҳоли сони': 4160,
        'хонадон сони': 1004,
        'оила сони': 920,
        'телефон рақам': '90-717-01-75'
    },
    'Ҳаёт МФЙ': {
        'Ф.И.Ш': 'Худойбердиев Музаффар Фахриддинович',
        'туғилган йил': 1990,
        'туғилган жойи': 'Самарқанд вилояти, Нарпай тумани',
        'миллати': 'Ўзбек',
        'маълумоти': 'Олий',
        'мутахассислиги': 'металлург',
        'маълумот олинган йил': 2014,
        'маълумот олинган жой': 'Навоий давлат кончилик институти',
        'аҳоли сони': 4076,
        'хонадон сони': 843,
        'оила сони': 1615,
        'телефон рақам': '97-797-88-57'
    },
    'Бинокор МФЙ': {
        'Ф.И.Ш': 'Умурзоқов Абдурасул Абдужамилович',
        'туғилган йил': 1974,
        'туғилган жойи': 'Навоий вилояти, Хатирчи тумани',
        'миллати': 'Ўзбек',
        'маълумоти': 'Олий',
        'мутахассислиги': 'ўқитувчи',
        'маълумот олинган йил': 1998,
        'маълумот олинган жой': 'Низомий номидаги Тошкент Давлат университети',
        'аҳоли сони': 3004,
        'хонадон сони': 1074,
        'оила сони': 1095,
        'телефон рақам': '90-730-82-99'
    },
    'Гулистон МФЙ': {
        'Ф.И.Ш': 'Бабаев Иброҳим Бахтиёрович',
        'туғилган йил': 1992,
        'туғилган жойи': 'Навоий вилояти, Навоий шаҳри',
        'миллати': 'Ўзбек',
        'маълумоти': 'Тугалланмаган олий',
        'мутахассислиги': 'ахборот тизимлари ва технологиялари (тармоқлар ва соҳалар бўйича)',
        'маълумот олинган йил': 2022,
        'маълумот олинган жой': 'Навоий инновациялар институти',
        'аҳоли сони': 3068,
        'хонадон сони': 816,
        'оила сони': 1025,
        'телефон рақам': '90-619-78-53'
    },
    'Бунёдкор МФЙ': {
        'Ф.И.Ш': 'Адилов Баходир Бабақулович',
        'туғилган йил': 1982,
        'туғилган жойи': 'Самарқанд вилояти, Каттақўрғон тумани',
        'миллати': 'Ўзбек',
        'маълумоти': 'Олий',
        'мутахассислиги': 'География фани ўқитувчиси',
        'маълумот олинган йил': 2008,
        'маълумот олинган жой': 'Навоий давлат педагогика институти',
        'аҳоли сони': 4482,
        'хонадон сони': 1280,
        'оила сони': 1312,
        'телефон рақам': '94-375-09-77'
    },
    'Янгиобод МФЙ': {
        'Ф.И.Ш': 'Тухтамишова Шоира Пўлатовна',
        'туғилган йил': 1967,
        'туғилган жойи': 'Самарқанд вилояти, Пахтачи тумани',
        'миллати': 'Ўзбек',
        'маълумоти': 'Олий',
        'мутахассислиги': 'Математика фани ўқитувчиси',
        'маълумот олинган йил': 1991,
        'маълумот олинган жой': 'Самарқанд давлат университети',
        'аҳоли сони': 6120,
        'хонадон сони': 1804,
        'оила сони': 2036,
        'телефон рақам': '93-430-18-04'
    },
    'Истиқлол МФЙ': {
        'Ф.И.Ш': 'Турсунов Икромжон Исматуллаевич',
        'туғилган йил': 1991,
        'туғилган жойи': 'Навоий вилояти, Навоий шаҳар',
        'миллати': 'Ўзбек',
        'маълумоти': 'Олий',
        'мутахассислиги': 'миллий истиқлол ғояси: ҳуқуқ ва маънавият асослари ўқитувчиси',
        'маълумот олинган йил': 2017,
        'маълумот олинган жой': 'Навоий давлат педагогика институти',
        'аҳоли сони': 4110,
        'хонадон сони': 805,
        'оила сони': 1355,
        'телефон рақам': '97-795-54-55'
    },
    'Ватан МФЙ': {
        'Ф.И.Ш': 'Адизов Шухрат Сайфидинович',
        'туғилган йил': 1978,
        'туғилган жойи': 'Навоий вилояти, Қизилтепа тумани',
        'миллати': 'Ўзбек',
        'маълумоти': 'Олий',
        'мутахассислиги': 'жисмоний тарбия ўқитувчиси',
        'маълумот олинган йил': 1999,
        'маълумот олинган жой': 'Навоий давлат педагогика институти',
        'аҳоли сони': 5185,
        'хонадон сони': 1542,
        'оила сони': 2234,
        'телефон рақам': '93-439-89-02'
    },
    'Ишонч МФЙ': {
        'Ф.И.Ш': 'Нуржанов Мухаммади Урозалиевич',
        'туғилган йил': 1985,
        'туғилган жойи': 'Самарқанд вилояти, Иштихон тумани',
        'миллати': 'Ўзбек',
        'маълумоти': 'Олий',
        'мутахассислиги': 'истиқлол асослари ва ҳуқуқ фанлари ўқитувчиси',
        'маълумот олинган йил': 2008,
        'маълумот олинган жой': 'Жиззах давлат педагогика институти',
        'аҳоли сони': 2158,
        'хонадон сони': 543,
        'оила сони': 540,
        'телефон рақам': '90-979-68-10'
    },
    'Ёшлик МФЙ': {
        'Ф.И.Ш': 'Эгамбердиев Аваз Жумаевич',
        'туғилган йил': 1975,
        'туғилган жойи': 'Навоий вилояти, Навоий шаҳри',
        'миллати': 'Ўзбек',
        'маълумоти': 'Тугалланмаган олий',
        'мутахассислиги': 'педагогика ва психология таълим йўналиши',
        'маълумот олинган йил': 2022,
        'маълумот олинган жой': 'PROFI UNIVERSITY хусусий университети',
        'аҳоли сони': 3871,
        'хонадон сони': 1108,
        'оила сони': 1040,
        'телефон рақам': '93-430-67-05'
    },
    'Навбахор МФЙ': {
        'Ф.И.Ш': 'Юлдашев Дилмурод Муродович',
        'туғилган йил': 1979,
        'туғилган жойи': 'Самарқанд вилояти, Ургут тумани',
        'миллати': 'Ўзбек',
        'маълумоти': 'Олий',
        'мутахассислиги': 'Рус тили ва адабиёти фани ўқитувчиси',
        'маълумот олинган йил': 2002,
        'маълумот олинган жой': 'Навоий давлат педагогика институти',
        'аҳоли сони': 4970,
        'хонадон сони': 1257,
        'оила сони': 1361,
        'телефон рақам': '99-903-13-01'
    },
    'Темирйўлчи МФЙ': {
        'Ф.И.Ш': 'Қодиров Сироҷиддин Бақоёрович',
        'туғилган йил': 1982,
        'туғилган жойи': 'Навоий вилояти, Қизилтепа тумани',
        'миллати': 'Ўзбек',
        'маълумоти': 'Олий',
        'мутахассислиги': 'тарих ва жамиятшунослик ўқитувчиси',
        'маълумот олинган йил': 2003,
        'маълумот олинган жой': 'Навоий давлат педагогика институти',
        'аҳоли сони': 2793,
        'хонадон сони': 821,
        'оила сони': 759,
        'телефон рақам': '97-796-70-57'
    },
    'Ҳақиқат МФЙ': {
        'Ф.И.Ш': 'Юсупов Мақсуд Муродович',
        'туғилган йил': 1968,
        'туғилган жойи': 'Қашқадарё вилояти, Қарши шаҳри',
        'миллати': 'Ўзбек',
        'маълумоти': 'Олий',
        'мутахассислиги': 'Математика',
        'маълумот олинган йил': 1994,
        'маълумот олинган жой': 'Карши давлат университети',
        'аҳоли сони': 3438,
        'хонадон сони': 759,
        'оила сони': 846,
        'телефон рақам': '91-406-75-57'
    },
    'Ўзбекистон МФЙ': {
        'Ф.И.Ш': 'Зайниддинов Абдулазиз Эркабоевич',
        'туғилган йил': 1990,
        'туғилган жойи': 'Навоий вилояти, Навоий шаҳар',
        'миллати': 'Ўзбек',
        'маълумоти': 'Олий',
        'мутахассислиги': 'Физика',
        'маълумот олинган йил': 2013,
        'маълумот олинган жой': 'Навоий давлат педагогика институти',
        'аҳоли сони': 4778,
        'хонадон сони': 1441,
        'оила сони': 1164,
        'телефон рақам': '91-407-17-71'
    },
    'Янгиҳаво МФЙ': {
        'Ф.И.Ш': 'Қўзиев Қобилжон Пирназарович',
        'туғилган йил': 1967,
        'туғилган жойи': 'Самарқанд вилояти, Нарпай тумани',
        'миллати': 'Ўзбек',
        'маълумоти': 'Олий',
        'мутахассислиги': 'тарих ва ҳуқуқ',
        'маълумот олинган йил': 1993,
        'маълумот олинган жой': 'Тошкент давлат университети',
        'аҳоли сони': 2320,
        'хонадон сони': 635,
        'оила сони': 579,
        'телефон рақам': '91-407-24-72'
    },
    'Баҳористон МФЙ': {
        'Ф.И.Ш': 'Туйғунов Асқар Маҳмудович',
        'туғилган йил': 1962,
        'туғилган жойи': 'Самарқанд вилояти, Каттақўрғон тумани',
        'миллати': 'Ўзбек',
        'маълумоти': 'Олий',
        'мутахассислиги': 'Физика фани ўқитувчиси',
        'маълумот олинган йил': 1983,
        'маълумот олинган жой': 'Самарқанд давлат университети',
        'аҳоли сони': 2702,
        'хонадон сони': 634,
        'оила сони': 740,
        'телефон рақам': '91-407-04-72'
    }
}

zarafshon_shahar = {
    'Алишер Навоий МФЙ': {
        'Ф.И.Ш': 'Вакант',
        'туғилган йил': 'Вакант',
        'туғилган жойи': 'Вакант',
        'миллати': 'Вакант',
        'маълумоти': 'Вакант',
        'мутахассислиги': 'Вакант',
        'маълумот олинган йил': 'Вакант',
        'маълумот олинган жой': 'Вакант',
        'аҳоли сони': 7728,
        'хонадон сони': 2343,
        'оила сони': 1722
    },
    '“Кончилар” МФЙ': {
        'Ф.И.Ш': 'Сувонова Дилноза Нуритдиновна',
        'туғилган йил': 1988,
        'туғилган жойи': 'Навоий вилояти, Кармана тумани',
        'миллати': 'Ўзбек',
        'маълумоти': 'Тугалланмаган олий',
        'мутахассислиги': 'психология',
        'маълумот олинган йил': 'Вакант',
        'маълумот олинган жой': 'Қозоғистон Республикаси Шымкент университети',
        'аҳоли сони': 7520,
        'хонадон сони': 1749,
        'оила сони': 2150,
        'телефон рақам': '93-438-01-49'
    },
    '“Олтин водий” МФЙ': {
        'Ф.И.Ш': 'Фармонов Фарход Саломович',
        'туғилган йил': 1971,
        'туғилган жойи': 'Бухоро вилояти, Ғиждувон тумани',
        'миллати': 'Ўзбек',
        'маълумоти': 'Олий',
        'мутахассислиги': 'инженер-педагог',
        'маълумот олинган йил': 2020,
        'маълумот олинган жой': 'Бухоро озиқ-овқат ва енгил саноат технология институти',
        'аҳоли сони': 4801,
        'хонадон сони': 1019,
        'оила сони': 1227,
        'телефон рақам': '93-462-61-51'
    },
    'Ўзбекистон МФЙ': {
        'Ф.И.Ш': 'Низомова Мавжуда Исроиловна',
        'туғилган йил': 1978,
        'туғилган жойи': 'Бухоро вилояти, Ғиждувон тумани',
        'миллати': 'Ўзбек',
        'маълумоти': 'Тугалланмаган олий',
        'мутахассислиги': 'педагогика психология',
        'маълумот олинган йил': 'Вакант',
        'маълумот олинган жой': 'Тошкент хусусий педагогика университети',
        'аҳоли сони': 4750,
        'хонадон сони': 1017,
        'оила сони': 2115,
        'телефон рақам': '93-460-44-40'
    },
    '“Қурувчи” МФЙ': {
        'Ф.И.Ш': 'Каланов Ойбек Хатамович',
        'туғилган йил': 1985,
        'туғилган жойи': 'Навоий вилояти, Нурота тумани',
        'миллати': 'Ўзбек',
        'маълумоти': 'Олий',
        'мутахассислиги': 'касбий-таълим',
        'маълумот олинган йил': 2007,
        'маълумот олинган жой': 'Тошкент давлат педагогика институти',
        'аҳоли сони': 7748,
        'хонадон сони': 2110,
        'оила сони': 2138,
        'телефон рақам': '93-314-33-01'
    },
    '“Ёшлик” МФЙ': {
        'Ф.И.Ш': 'Рўзиев Алишер Абдуллаевич',
        'туғилган йил': 1968,
        'туғилган жойи': 'Навоий вилояти, Хатирчи тумани',
        'миллати': 'Ўзбек',
        'маълумоти': 'Олий',
        'мутахассислиги': 'қурилиш ва архитектура',
        'маълумот олинган йил': 1994,
        'маълумот олинган жой': 'Мирзо Улуғбек номидаги Самарқанд давлат қурилиш ва архитектура институти',
        'аҳоли сони': 5179,
        'хонадон сони': 1020,
        'оила сони': 1522,
        'телефон рақам': '93-663-42-35'
    },
    '“Истиқлол” МФЙ': {
        'Ф.И.Ш': 'Уразов Азиз Абдуҳошимович',
        'туғилган йил': 1983,
        'туғилган жойи': 'Навоий вилояти, Нурота тумани',
        'миллати': 'Ўзбек',
        'маълумоти': 'Олий',
        'мутахассислиги': 'иқтисодиёт ва бошқаруви',
        'маълумот олинган йил': 2008,
        'маълумот олинган жой': 'Самарқанд қишлоқ хўжалик институти',
        'аҳоли сони': 5683,
        'хонадон сони': 1270,
        'оила сони': 1762,
        'телефон рақам': '99-434-83-02'
    },
    '“Тинчлик” МФЙ': {
        'Ф.И.Ш': 'Чулиев Акбар Бахронович',
        'туғилган йил': 1977,
        'туғилган жойи': 'Навоий вилояти, Нурота тумани',
        'миллати': 'Ўзбек',
        'маълумоти': 'Тугалланмаган олий',
        'мутахассислиги': 'бухгалтерия',
        'маълумот олинган йил': 'Вакант',
        'маълумот олинган жой': 'Тожикистон педагогика институти',
        'аҳоли сони': 8123,
        'хонадон сони': 1715,
        'оила сони': 2212,
        'телефон рақам': '93-660-68-76'
    },
    '“Истиқлол” МФЙ': {
        'Ф.И.Ш': 'Турдиев Бурхон Ғуломович',
        'туғилган йил': 1980,
        'туғилган жойи': 'Навоий вилояти, Қизилтепа тумани',
        'миллати': 'Ўзбек',
        'маълумоти': 'Олий',
        'мутахассислиги': 'ҳуқуқшунослик',
        'маълумот олинган йил': 2004,
        'маълумот олинган жой': 'Навоий Давлат педагогика институти',
        'аҳоли сони': 7350,
        'хонадон сони': 2232,
        'оила сони': 2190,
        'телефон рақам': '93-461-63-22'
    },
    '“Баҳор” МФЙ': {
        'Ф.И.Ш': 'Примова Нигора Қудратовна',
        'туғилган йил': 1975,
        'туғилган жойи': 'Навоий вилояти, Қизилтепа тумани',
        'миллати': 'Ўзбек',
        'маълумоти': 'Тугалланмаган олий',
        'мутахассислиги': 'мактабгача таълим тарбиячи',
        'маълумот олинган йил': 2020,
        'маълумот олинган жой': 'Навоий давлат педагогика институти',
        'аҳоли сони': 5894,
        'хонадон сони': 1158,
        'оила сони': 1427,
        'телефон рақам': '93-463-48-75'
    },
    '“Наврўз” МФЙ': {
        'Ф.И.Ш': 'Ризақулова Озода Салимтошевна',
        'туғилган йил': 1983,
        'туғилган жойи': 'Навоий вилояти, Хатирчи тумани',
        'миллати': 'Ўзбек',
        'маълумоти': 'Олий',
        'мутахассислиги': 'она тили ва адабиёт фани ўқитувчиси',
        'маълумот олинган йил': 2009,
        'маълумот олинган жой': 'Навоий давлат педагогика институти',
        'аҳоли сони': 7054,
        'хонадон сони': 1936,
        'оила сони': 2048,
        'телефон рақам': '93-663-77-57'
    },
    '“Юлдуз” МФЙ': {
        'Ф.И.Ш': 'Икромов Зухриддин Қулмаматович',
        'туғилган йил': 1979,
        'туғилган жойи': 'Навоий вилояти, Хатирчи тумани',
        'миллати': 'Ўзбек',
        'маълумоти': 'Олий',
        'мутахассислиги': 'ҳуқуқшунос',
        'маълумот олинган йил': 2004,
        'маълумот олинган жой': 'Ўзбекистон Республикаси Ички Ишлар Вазирлиги Академияси',
        'аҳоли сони': 7208,
        'хонадон сони': 1427,
        'оила сони': 1557,
        'телефон рақам': '93-431-05-64'
    },
    '“Янги-Зарафшон” МФЙ': {
        'Ф.И.Ш': 'Жахонгиров Ихтиёр Қувондиқович',
        'туғилган йил': 1974,
        'туғилган жойи': 'Бухоро вилояти, Ғиждувон тумани',
        'миллати': 'Ўзбек',
        'маълумоти': 'Олий',
        'мутахассислиги': 'иқтисодчи',
        'маълумот олинган йил': 1997,
        'маълумот олинган жой': 'Тошкент давлат аграр университети',
        'аҳоли сони': 5851,
        'хонадон сони': 1023,
        'оила сони': 1544,
        'телефон рақам': '93-950-02-97'
    },
    '“Даугизтау” МФЙ': {
        'Ф.И.Ш': 'Парманова Мақсуда Мамадалиевна',
        'туғилган йил': 1987,
        'туғилган жойи': 'Навоий вилояти, Навбаҳор тумани',
        'миллати': 'Ўзбек',
        'маълумоти': 'Тугалланмаган олий',
        'мутахассислиги': 'Мактабгача таълим',
        'маълумот олинган йил': 2022,
        'маълумот олинган жой': 'Навоий иновасиялар институти',
        'аҳоли сони': 2122,
        'хонадон сони': 441,
        'оила сони': 601,
        'телефон рақам': '33-950-35-72'
    },
    '“Мурунтау” МФЙ': {
        'Ф.И.Ш': 'Сирожов Зафар Ибрагимович',
        'туғилган йил': 1982,
        'туғилган жойи': 'Навоий вилояти, Хатирчи тумани',
        'миллати': 'Ўзбек',
        'маълумоти': 'Олий',
        'мутахассислиги': 'математика фани ўқитувчиси',
        'маълумот олинган йил': 2008,
        'маълумот олинган жой': 'Жиззах давлат педагогика институти',
        'аҳоли сони': 3396,
        'хонадон сони': 951,
        'оила сони': 1012,
        'телефон рақам': '93-318-51-40'
    }
}

gazgon_shahar = {
    'Мармаробод МФЙ': {
        'Ф.И.Ш': 'Тўқсанова Мухиба Ҳамроевна',
        'туғилган йил': 1967,
        'туғилган жойи': 'Навоий вилояти, Ғозғон шаҳар',
        'миллати': 'Ўзбек',
        'маълумоти': 'Олий',
        'мутахассислиги': 'Ўзбек тили ва адабиёти фани ўқитувчиси',
        'маълумот олинган йил': 'Вакант',
        'маълумот олинган жой': 'Низомий номли Тошкент давлат педагогика институти',
        'аҳоли сони': 2746,
        'хонадон сони': 555,
        'оила сони': 729,
        'телефон рақам': '97-378-00-67'
    },
    'Тумар МФЙ': {
        'Ф.И.Ш': 'Аминов Аббос Эргашевич',
        'туғилган йил': 1988,
        'туғилган жойи': 'Навоий вилояти, Ғозғон шаҳар',
        'миллати': 'Ўзбек',
        'маълумоти': 'Тугалланмаган олий',
        'мутахассислиги': 'география фани ўқитувчиси',
        'маълумот олинган йил': 'Вакант',
        'маълумот олинган жой': 'Навоий давлат педагогика институти талабаси',
        'аҳоли сони': 1816,
        'хонадон сони': 338,
        'оила сони': 505,
        'телефон рақам': '90-235-77-77'
    },
    'Шайхон МФЙ': {
        'Ф.И.Ш': 'Шарипов Жамол Шафиевич',
        'туғилган йил': 1970,
        'туғилган жойи': 'Навоий вилояти, Ғозғон шаҳар',
        'миллати': 'Ўзбек',
        'маълумоти': 'Тугалланмаган олий',
        'мутахассислиги': 'халқаро молия ва бухгалтерия',
        'маълумот олинган йил': 'Вакант',
        'маълумот олинган жой': 'ISFT institute (INTERNATIONAL SCHOOL OF FINANCE TECHNOLOGY AND SCIENCE)',
        'аҳоли сони': 2226,
        'хонадон сони': 366,
        'оила сони': 560,
        'телефон рақам': '91-991-15-91'
    },
    'Гулистон МФЙ': {
        'Ф.И.Ш': 'Жумаев Эмин Салимович',
        'туғилган йил': 1971,
        'туғилган жойи': 'Навоий вилояти, Ғозғон шаҳар',
        'миллати': 'Ўзбек',
        'маълумоти': 'Олий',
        'мутахассислиги': 'бошланғич синфларда мусиқа фани  ўқитувчиси',
        'маълумот олинган йил': 2021,
        'маълумот олинган жой': 'Навоий давлат педагогика институти',
        'аҳоли сони': 2262,
        'хонадон сони': 368,
        'оила сони': 662,
        'телефон рақам': '90-085-35-60'
    }
}

karmana_shahar = {
    "Дегарон": {
        "Исм": "Адизов Вали Шералиевич",
        "Тугилган_йил": "1982 йил",
        "Вилоят": "Навоий вилояти",
        "Туман": "Кармана тумани",
        "Миллат": "Ўзбек",
        "Таҳсилий": "Олий",
        "Таҳсил": "2006 йил, Навоий давлат педагогика институти",
        "Мутахассислик": "Жисмоний тарбия фани ўқитувчиси",
        "Аҳоли": 3130,
        "Оиласи": 873,
        "Хонадон": 623,
        "Телефон": "99-458-82-00"
    },
    "Паҳлавон": {
        "Исм": "Эгамов Сирожиддин Садриддин ўғли",
        "Тугилган_йил": "1992 йил",
        "Вилоят": "Навоий вилояти",
        "Туман": "Кармана тумани",
        "Миллат": "Ўзбек",
        "Таҳсилий": "Олий",
        "Таҳсил": "2016 йил, Тошкент давлат аграр университети, ўсимликларни ҳимоя қилиш ва карантини",
        "Аҳоли": 2650,
        "Оиласи": 660,
        "Хонадон": 530,
        "Телефон": "93-463-33-88"
    },
    "Ҳазора": {
        "Исм": "Б/ердихолов Азим Юсуфович",
        "Тугилган_йил": "1974 йил",
        "Вилоят": "Навоий вилояти",
        "Туман": "Кармана тумани",
        "Миллат": "Ўзбек",
        "Таҳсилий": "Олий",
        "Таҳсил": "1996 йил, Навоий давлат кончилик институти, иқтисодчи муҳандис",
        "Аҳоли": 2826,
        "Оиласи": 695,
        "Хонадон": 556,
        "Телефон": "99-028-86-22"
    },
    "Малик": {
        "Исм": "Тўқлиев Азиз Толибович",
        "Тугилган_йил": "1982 йил",
        "Вилоят": "Навоий вилояти",
        "Туман": "Кармана тумани",
        "Миллат": "Ўзбек",
        "Таҳсилий": "Олий",
        "Таҳсил": "2008 йил, Навоий давлат  педагогика институти",
        "Мутахассислик": "Жисмоний тарбия ва жисмоний маданият ўқитувчиси",
        "Аҳоли": 2705,
        "Оиласи": 822,
        "Хонадон": 611,
        "Телефон": "99-289-41-15"
    },
    "Сардоба": {
        "Исм": "Зокиров Нўъмон Собирович",
        "Тугилган_йил": "1973 йил",
        "Вилоят": "Бухоро вилояти",
        "Туман": "Шофиркон тумани",
        "Миллат": "Ўзбек",
        "Таҳсилий": "Олий",
        "Таҳсил": "1996 йил, Бухоро давлат университети, касб таълими",
        "Аҳоли": 2458,
        "Оиласи": 732,
        "Хонадон": 544,
        "Телефон": "99-779-40-35"
    },
    "Дўстлик": {
        "Исм": "Шодиев Анвар Ахтамович",
        "Тугилган_йил": "1976 йил",
        "Вилоят": "Навоий вилояти",
        "Туман": "Нурото тумани",
        "Миллат": "Ўзбек",
        "Таҳсилий": "Олий",
        "Таҳсил": "2008 йил, Тошкент давлат аграр университети, Зоотехник",
        "Аҳоли": 3287,
        "Оиласи": 1312,
        "Хонадон": 1227,
        "Телефон": "99-336-00-76"
    },
        "Бую": {
        "МФЙ": "",
        "Исм": "Ниёзбеков Баҳодир Ҳамид уғли",
        "Тугилган_йил": "1995 йил",
        "Вилоят": "Навоий вилояти",
        "Туман": "Бую тумани",
        "Миллат": "Ўзбек",
        "Таҳсилий": "Олий",
        "Таҳсил": "2018 йил, Қорақалпоғистон Давлат Университети, Агроэкология",
        "Аҳоли": 1790,
        "Оиласи": 470,
        "Хонадон": 352,
        "Телефон": "90-773-17-57"
    },
    "Мирзачўл": {
        "МФЙ": "",
        "Исм": "Сатторов Миржахмад Хуршиджон уғли",
        "Тугилган_йил": "1991 йил",
        "Вилоят": "Навоий вилояти",
        "Туман": "Кармана тумани",
        "Миллат": "Ўзбек",
        "Таҳсилий": "Олий",
        "Таҳсил": "2016 йил, Тошкент давлат аграр университети, зоотехник",
        "Аҳоли": 1956,
        "Оиласи": 485,
        "Хонадон": 370,
        "Телефон": "94-888-31-31"
    },
    "Мирзаабад": {
        "МФЙ": "",
        "Исм": "Тўраев Руслан Мамадалиевич",
        "Тугилган_йил": "1973 йил",
        "Вилоят": "Навоий вилояти",
        "Туман": "Мирзаабад тумани",
        "Миллат": "Ўзбек",
        "Таҳсилий": "Олий",
        "Таҳсил": "1997 йил, Навоий давлат педагогика институти, биология фани ўқитувчиси",
        "Аҳоли": 3010,
        "Оиласи": 842,
        "Хонадон": 632,
        "Телефон": "94-677-76-86"
    }
}

konimex_shahar = {
    "Бирлик": {
        "Исм": "Муратова Рўзигул Минлибаевна",
        "Тугилган_йил": "1966 йил",
        "Вилоят": "Навоий вилояти",
        "Туман": "Конимех тумани",
        "Миллат": "Қорақалпоқ",
        "Таҳсилий": "Ўрта-махсус",
        "Таҳсил": "1985 й. Самарқанд молия техникуми (кундузги)",
        "Аҳоли": 2110,
        "Оиласи": 725,
        "Хонадон": 612,
        "Телефон": "93-430-77-61"
    },
    "Наврўз": {
        "Исм": "Хайитов Ғафур Имомкулович",
        "Тугилган_йил": "23.08.1964",
        "Вилоят": "Навоий вилояти",
        "Туман": "Конимех тумани",
        "Миллат": "Ўзбек",
        "Таҳсилий": "Ўрта махсус",
        "Аҳоли": 2760,
        "Оиласи": 886,
        "Хонадон": 590,
        "Телефон": "93-461-41-61"
    },
    "Учтепа": {
        "Исм": "Исаев Олжас Кидирбаевич",
        "Тугилган_йил": "1974 йил",
        "Вилоят": "Навоий вилояти",
        "Туман": "Конимех тумани",
        "Миллат": "Қозоқ",
        "Таҳсилий": "Олий",
        "Таҳсил": "1996 й. Ташкент Жаҳон тиллари университети, Рус тили ва адабиёти ўқитувчиси",
        "Аҳоли": 2255,
        "Оиласи": 526,
        "Хонадон": 476,
        "Телефон": "95-610-74-75"
    },
    "Баймурат": {
        "Исм": "Рахметов Бакыт Умирзакович",
        "Тугилган_йил": "1980 йил",
        "Вилоят": "Навоий вилояти",
        "Туман": "Конимех тумани",
        "Миллат": "Қозоқ",
        "Таҳсилий": "Олий",
        "Таҳсил": "2002 й. Навоий Давлат Педагогика институти Математика ва информатика факультети",
        "Аҳоли": 2933,
        "Оиласи": 634,
        "Хонадон": 536,
        "Телефон": "93-436-80-02"
    },
    "Юксалиш": {
        "Исм": "ВАКАНТ",
        "Аҳоли": 2185,
        "Оиласи": 576,
        "Хонадон": 518
    },
    "Шўртепа": {
        "Исм": "Наркулов Суннатжон Фархадович",
        "Тугилган_йил": "1992 йил",
        "Вилоят": "Навоий вилояти",
        "Туман": "Конимех тумани",
        "Миллат": "Қорақалпоқ",
        "Таҳсилий": "Олий",
        "Таҳсил": "2016 й. Навоий Давлат Педагогика институти, жисмоний маданият",
        "Аҳоли": 2603,
        "Оиласи": 779,
        "Хонадон": 646,
        "Телефон": "97-796-01-53"
    },
    "Саржал": {
        "Исм": "Маекеев  Алтинбек  Игиликович",
        "Тугилган_йил": "1970 йил",
        "Вилоят": "Навоий вилояти",
        "Туман": "Конимех тумани",
        "Миллат": "Қозоқ",
        "Таҳсилий": "Олий",
        "Таҳсил": "1996 й. Навоий  Давлат Педагогика институти, бошланғич таълим",
        "Аҳоли": 1637,
        "Оиласи": 440,
        "Хонадон": 343,
        "Телефон": "94-229-70-05"
    },
    "Шўркул": {
        "Исм": "Аимуханбетова Нурсулу Жузжасаровна",
        "Тугилган_йил": "1983 йил",
        "Вилоят": "Навоий вилояти",
        "Туман": "Конимех тумани",
        "Миллат": "Қозоқ",
        "Таҳсилий": "Олий",
        "Таҳсил": "2009 й. Навоий Давлат Педагогика институти, бошланғич таълим",
        "Аҳоли": 1744,
        "Оиласи": 520,
        "Хонадон": 352,
        "Телефон": "93-435-14-83"
    },
    "Тўққизтепа": {
        "Исм": "Бахрамов Бердақ Бақитберген ўғли",
        "Тугилган_йил": "1998 йил",
        "Вилоят": "Навоий вилояти",
        "Туман": "Конимех тумани",
        "Миллат": "Қорақалпоқ",
        "Таҳсилий": "Олий",
        "Таҳсил": "2021 й. Навоий Давлат Педагогика институти, жисмоний тарбия фани ўқитувчиси",
        "Аҳоли": 2002,
        "Оиласи": 635,
        "Хонадон": 455,
        "Телефон": "94-891-43-47"
    },
    "Зафарабод": {
        "Исм": "Жалолов Эркин Жалилович",
        "Тугилган_йил": "1967 йил",
        "Вилоят": "Бухоро вилояти",
        "Туман": "Ғиждувон тумани",
        "Миллат": "Ўзбек",
        "Таҳсилий": "Тугалланмаган олий",
        "Таҳсил": "2021 й. Педагогика университети, Педагогика-психология",
        "Аҳоли": 6004,
        "Оиласи": 1886,
        "Хонадон": 1734,
        "Телефон": "93-089-13-20"
    },
    "Қарақ-ата": {
        "Исм": "Серикбаев Нурбол Тулегенович",
        "Тугилган_йил": "1979 йил",
        "Вилоят": "Навоий вилояти",
        "Туман": "Конимех тумани",
        "Миллат": "Қозоқ",
        "Таҳсилий": "Олий",
        "Таҳсил": "2000 й. Ўзбекистон Давлат Жисмоний тарбия институти, Жисмоний тарбия ўқитувчи",
        "Аҳоли": 1574,
        "Оиласи": 373,
        "Хонадон": 338,
        "Телефон": "93-313-99-04"
    },
    "Гулистон": {
        "Исм": "Ходжамкулов Куралбай Турдыбайевич",
        "Тугилган_йил": "1985 йил",
        "Вилоят": "Навоий вилояти",
        "Туман": "Конимех тумани",
        "Миллат": "Қорақалпоқ",
        "Таҳсилий": "Олий",
        "Таҳсил": "2011 й. Навоий Давлат педагогика институти, Мусикий таълим ўқитувчиси",
        "Аҳоли": 2761,
        "Оиласи": 712,
        "Хонадон": 628,
        "Телефон": "93-316-89-85"
    },
    "Дўстлик": {
        "Исм": "Раджабов Махмуд Асланович",
        "Тугилган_йил": "1966 йил",
        "Вилоят": "Навоий вилояти",
        "Туман": "Конимех тумани",
        "Миллат": "Араб",
        "Таҳсилий": "Тугалланмаган ОЛИЙ",
        "Аҳоли": 1881,
        "Оиласи": 524,
        "Хонадон": 514,
        "Телефон": "93-956-23-64"
    },
    "Кўкча": {
        "Исм": "Сарсенбаева Клара Дуйсеновна",
        "Тугилган_йил": "1982 йил",
        "Вилоят": "Навоий вилояти",
        "Туман": "Конимех тумани",
        "Миллат": "Қозоқ",
        "Таҳсилий": "Олий",
        "Таҳсил": "2005 й Навоий Давлат Педагогика Институти, Математика ва информатика фани ўқитувчиси",
        "Аҳоли": 1351,
        "Оиласи": 423,
        "Хонадон": 328,
        "Телефон": "93-061-00-82"
    },
    "Янгиқазғон": {
        "Исм": "Узаков  Бахыт Ачилович",
        "Тугилган_йил": "1976 йил",
        "Вилоят": "Навоий вилояти",
        "Туман": "Конимех тумани",
        "Миллат": "Қорақалпоқ",
        "Таҳсилий": "Олий",
        "Таҳсил": "1997 й. Навоий Давлат Педагогика институти, ўқитувчиси",
        "Аҳоли": 3653,
        "Оиласи": 796,
        "Хонадон":    736,
        "Телефон": "99-173-20-13"
    }
}

qiziltepa_shahar = {
    "Хўжақўрғон МФЙ": {
        "fullname": "Эрназаров Хуршид Умарович",
        "birthdate": "1984 йил",
        "location": {
            "region": "Навоий вилояти",
            "district": "Қизилтепа тумани"
        },
        "nationality": "ўзбек",
        "education": {
            "degree": "Олий",
            "year": "2008 йил",
            "institution": "НДПИ",
            "field": "жисмоний тарбия ўқитувчиси"
        },
        "population": {
            "total": 2790,
            "families": 697,
            "houses": 602
        },
        "contact": "91-338-61-91"
    },
    "Сарой МФЙ": {
        "fullname": "Равшанова Махбуба Асадовна",
        "birthdate": "1979 йил",
        "location": {
            "region": "Навоий вилояти",
            "district": "Қизилтепа тумани"
        },
        "nationality": "ўзбек",
        "education": {
            "degree": "Олий",
            "year": "2000 й",
            "institution": "Ўзбекистон миллий университети",
            "field": "психолог"
        },
        "population": {
            "total": 2907,
            "families": 848,
            "houses": 629
        },
        "contact": "99-081-12-48"
    },
    "Ғамхўр МФЙ": {
        "fullname": "Турсунов Отамурод Шодиевич",
        "birthdate": "1971 йил",
        "location": {
            "region": "Навоий вилояти",
            "district": "Қизилтепа тумани"
        },
        "nationality": "ўзбек",
        "education": {
            "degree": "Олий",
            "year": "1996 й",
            "institution": "Гулистон давлат унверисити",
            "field": "биалогия ва қишлоқ хўжалигифани ўқитувчиси"
        },
        "population": {
            "total": 2462,
            "families": 709,
            "houses": 527
        },
        "contact": "90-620-33-28"
    },
    "Нурафшон МФЙ": {
        "fullname": "Ғаниев Қахрамон Рустамович",
        "birthdate": "1973 йил",
        "location": {
            "region": "Навоий вилояти",
            "district": "Қизилтепа тумани"
        },
        "nationality": "ўзбек",
        "education": {
            "degree": "Олий",
            "year": "1995 й",
            "institution": "Бухоро Давлат педагогика университети",
            "field": "Физика фани фани ўқитувчиси"
        },
        "population": {
            "total": 2446,
            "families": 774,
            "houses": 507
        },
        "contact": "91-332-62-10"
    },
    "Ҳумо МФЙ": {
        "fullname": "Рузиев Бойпулот Тураевич",
        "birthdate": "1978 йил",
        "location": {
            "region": "Навоий вилояти",
            "district": "Қизилтепа тумани"
        },
        "nationality": "ўзбек",
        "education": {
            "degree": "Олий",
            "year": "1998 й",
            "institution": "Тошкент педагогика институти",
            "field": "Ўқув ўқитувчиси"
        },
        "population": {
            "total": 2580,
            "families": 803,
            "houses": 532
        },
        "contact": "90-367-62-52"
    }
}

nurota_shahar = [
    {
        "id": 208,
        'mahalla':'Сайдато',
        "name": "Жалолов Ҳотам Ҳайдарович",
        "birth_year": 1968,
        "birth_place": "Навоий вилояти, Нурота тумани",
        "nationality": "Ўзбек",
        "education": {
            "degree": "Олий",
            "year": 1993,
            "institution": "Самарқанд Давлат меъморчилик қурилиш институти",
            "major": "Инженер қурувчи"
        },
        "population": {
            "total": 1356,
            "family": 448,
            "household": 204
        },
        "contact": "94-480-67-69"
    },
    {
        "id": 209,
        'mahalla':'Авазсой',
        "name": "Ирисов Шахриёр Низомиддинович",
        "birth_year": 1987,
        "birth_place": "Навоий вилояти, Нурота тумани",
        "nationality": "Ўзбек",
        "education": {
            "degree": "Олий",
            "year": 2016,
            "institution": "Навоий Давлат педагогика институти",
            "major": "Физика ва астраномия фани ўқитувчиси"
        },
        "population": {
            "total": 2250,
            "family": 602,
            "household": 396
        },
        "contact": "99-075-13-87"
    },
    {
        "id": 210,
        'mahalla':'Турко',
        "name": "Бобоев Авазжон Акмалович",
        "birth_year": 1980,
        "birth_place": "Навоий вилояти, Нурота тумани",
        "nationality": "Ўзбек",
        "education": {
            "degree": "Олий",
            "year": 2006,
            "institution": "Самарқанд Давлат Архитектура Қурилиш Институти",
            "major": "Касбий таълим бино ва иншоотлар қурилиши"
        },
        "population": {
            "total": 1496,
            "family": 502,
            "household": 256
        },
        "contact": "95-777-01-80"
    },
    {
        "id": 211,
        'mahalla':'Мустақиллик',
        "name": "Ҳабибов Маъмур Абдулхайрович",
        "birth_year": 1986,
        "birth_place": "Навоий вилояти, Нурота тумани",
        "nationality": "Ўзбек",
        "education": {
            "degree": "Олий",
            "year": 2013,
            "institution": "Самарқанд Давлат архитуктура институти",
            "major": "Ер тузиш ва ер кадастри"
        },
        "population": {
            "total": 4540,
            "family": 1137,
            "household": 1082
        },
        "contact": "97-796-44-66"
    },
    {
        "id": 212,
        'mahalla':'Оқмачит',
        "name": "Юсупов Фаттоҳ Маҳмудович",
        "birth_year": 1967,
        "birth_place": "Навоий вилояти, Нурота тумани",
        "nationality": "Ўзбек",
        "education": {
            "degree": "Олий",
            "year": 1992,
            "institution": "Тошкент Давлат техника институти",
            "major": "Механик инжинер"
        },
        "population": {
            "total": 2762,
            "family": 605,
            "household": 452
        },
        "contact": "94-374-24-26"
    },
    {
        "id": 213,
        'mahalla':'Орасой',
        "name": "Бекмуродов Нурилло Дилмуродович",
        "birth_year": 1990,
        "birth_place": "Навоий вилояти, Нурота тумани",
        "nationality": "Ўзбек",
        "education": {
            "degree": "Олий",
            "year": 2020,
            "institution": "Навоий давлат педагогика институти",
            "major": "Технология фани ўқитувчиси"
        },
        "population": {
            "total": 1747,
            "family": 475,
            "household": 411
        },
        "contact": "93-439-97-19"
    },
    {
        "id": 214,
        "mahalla": "Деҳибаланд",
        "population": {
            "total": 1863,
            "family": 536,
            "household": 396
        }
    },
    {
        "id": 215,
        'mahalla':'Темирқовуқ',
        "name": "Остонов Жўрабек Қурбонбоевич",
        "birth_year": 1983,
        "birth_place": "Навоий вилояти, Нурота тумани",
        "nationality": "Ўзбек",
        "education": {
            "degree": "Олий",
            "year": 2006,
            "institution": "Тошкент давлат аграр университети",
            "major": "Хосилотчи"
        },
        "population": {
            "total": 5137,
            "family": 1071,
            "household": 905
        },
        "contact": "99-128-45-49"
    },
    {
        "id": 216,
        'mahalla':'Тинчлик',
        "name": "Қозоқова Рахима Норқуловна",
        "birth_year":        1968,
        "birth_place": "Навоий вилояти, Нурота тумани",
        "nationality": "Ўзбек",
        "education": {
            "degree": "Олий",
            "year": 1990,
            "institution": "Жаҳон тиллар университети",
            "major": "Рус тили ва адабиёти"
        },
        "population": {
            "total": 3006,
            "family": 620,
            "household": 568
        },
        "contact": "99-597-94-68"
    },
    {
        "id": 217,
        'mahalla':'Амир Темур',
        "name": "Ҳошимов Ойбек Нематиллаевич",
        "birth_year": 1983,
        "birth_place": "Навоий вилояти, Нурота тумани",
        "nationality": "Ўзбек",
        "education": {
            "degree": "Тугалланмаган олий",
            "year": 2021,
            "institution": "Навоий Давлат Педагогика Институти",
            "major": "Ижтимоий иш"
        },
        "population": {
            "total": 3553,
            "family": 881,
            "household": 761
        },
        "contact": "94-899-28-83"
    },
    {
        "id": 218,
        'mahalla':'Сентоб',
        "name": "Мирзоев Мурод Гулназарович",
        "birth_year": 1970,
        "birth_place": "Навоий вилояти, Нурота тумани",
        "nationality": "Тожик",
        "education": {
            "degree": "Олий",
            "year": 1993,
            "institution": "Самарқанд Давлат университети",
            "major": "Умумий техника фанлари"
        },
        "population": {
            "total": 2241,
            "family": 623,
            "household": 393
        },
        "contact": "99-552-11-02"
    },
    {
        "id": 219,
        'mahalla':'Каттасой',
        "name": "Тилабов Ашраф Низомович",
        "birth_year": 1974,
        "birth_place": "Навоий вилояти, Нурота тумани",
        "nationality": "Тожик",
        "education": {
            "degree": "Олий",
            "year": 1992,
            "institution": "Тожикистон давлат университети",
            "major": "Иқтисодчи"
        },
        "population": {
            "total": 1848,
            "family": 402,
            "household": 317
        },
        "contact": "99-415-74-06"
    },
    {
        "id": 220,
        'mahalla':'Қизилча',
        "name": "Норбобоев Нурбек Ёдгорович",
        "birth_year": 1974,
        "birth_place": "Навоий вилояти, Нурота тумани",
        "nationality": "Ўзбек",
        "education": {
            "degree": "Олий",
            "year": 2008,
            "institution": "Навоий давлат педагогика иниститути",
            "major": "Жисмоний тарбия фани ўқитувчиси"
        },
        "population": {
            "total": 2773,
            "family": 781,
            "household": 664
        },
        "contact": "93-300-07-74"
    },
    {
        "id": 221,
        'mahalla':'Истиқбол',
        "name": "Ахмедов Зойир Зокирович",
        "birth_year": 1975,
        "birth_place": "Навоий вилояти, Нурота тумани",
        "nationality": "Ўзбек",
        "education": {
            "degree": "Тугалланмаган олий",
            "year": 0,
            "institution": "Ўзбекистон Давлат Жисмоний-тарбия ва спорт университети",
            "major": "жисмоний тарбия фани ўқитувчиси"
        },
        "population": {
            "total": 2510,
            "family": 515,
            "household": 418
        },
        "contact": "99-945-46-09"
    },
    {
        "id": 222,
        'mahalla':'Бўстон',
        "name": "Сафаев Эшмухаммад Каримович",
        "birth_year": 1971,
        "birth_place": "Навоий вилояти, Нурота тумани",
        "nationality": "Ўзбек",
        "education": {
            "degree": "Олий",
            "year": 1995,
            "institution": "Самарқанд Давлат Университети",
            "major": "Unknown"
        },
        "population": {
            "total": 2780,
            "family": 631,
            "household": 376
        },
        "contact": "93-313-71-95"
    },
    {
        "id": 223,
        'mahalla':'Чуя',
        "name": "Рахмонов Орзимурод Аманқулович",
        "birth_year": 1973,
        "birth_place": "Навоий вилояти, Нурота тумани",
        "nationality": "Ўзбек",
        "education": {
            "degree": "Олий",
            "year": 2003,
            "institution": "Навоий Давлат Педагогика Институти",
            "major": "Бошланғич синф ўқитувчиси"
        },
        "population": {
            "total": 3889,
            "family": 791,
            "household": 674
        },
        "contact": "94-225-19-73"
    },
    {
       "id": 224,
        'mahalla':'Жарма',
        "name": "Мирзаев Жамолиддин Умирзақович",
        "birth_year": 1983,
        "birth_place": "Навоий вилояти, Нурота тумани",
        "nationality": "Ўзбек",
        "education": {
            "degree": "Тугалланмаган олий",
            "year": 2020,
            "institution": "Тошкент Давлат Аграр Университети талабаси",
            "major": "Университети талабаси"
        },
        "population": {
            "total": 5245,
            "family": 1345,
            "household": 1005
        },
        "contact": "94-251-58-08"
    },{
        "id": 225,
        "mahalla": "Истиқлол МФЙ",
        "name": "Аҳмедов Шерзод Ҳазратович",
        "birth_year": 1982,
        "birth_place": "Навоий вилояти, Нурота тумани",
        "nationality": "Ўзбек",
        "education": {
            "degree": "Олий",
            "year": 2007,
            "institution": "Тошкент Давлат Иқтисодиёт Университети",
            "major": "Молия"
        },
        "population": {
            "total": 3116,
            "family": 540,
            "household": 492
        },
        "contact": "88-379-07-77"
    },{
        "id": 226,
        "mahalla": "Қадоқ МФЙ",
        "name": "Раҳимқулов Нодир Исроилович",
        "birth_year": 1983,
        "birth_place": "Навоий вилояти, Нурота тумани",
        "nationality": "Ўзбек",
        "education": {
            "degree": "Олий",
            "year": 2006,
            "institution": "Самарқанд Қишлоқ хўжалиги институти",
            "major": "Зоотехния қоракўлшунос технолог"
        },
        "population": {
            "total": 2295,
            "family": 597,
            "household": 328
        },
        "contact": "93-105-27-77"
    },{
        "id": 227,
        "mahalla": "Янгитурмуш МФЙ",
        "name": "Буранов Дониёр Қушмуратович",
        "birth_year": 1965,
        "birth_place": "Навоий вилояти, Нурота тумани",
        "nationality": "Ўзбек",
        "education": {
            "degree": "Олий",
            "year": 1987,
            "institution": "Тошкент ирригация ва қишлоқ хўжалигини механизациялаштирш инженерлари институти",
            "major": "Инженер-механик"
        },
        "population": {
            "total": 2893,
            "family": 557,
            "household": 464
        },
        "contact": "94-376-51-69"
    },{
        "id": 228,
        "mahalla": "Ғафур Ғулом",
        "name": "Саидов Раҳматжон Ҳамроқулович",
        "birth_year": 1967,
        "birth_place": "Навоий вилояти, Нурота тумани",
        "nationality": "Ўзбек",
        "education": {
            "degree": "Тугалланмаган Олий",
            "year": 2022,
            "institution": "Самарқанд шахридаги Беларусия Миллий техника институти",
            "major": "Менежер"
        },
        "population": {
            "total": 3010,
            "family": 621,
            "household": 506
        },
        "contact": "94-343-00-67"
    },{
        "id": 230,
        "mahalla": "Эшон Судур",
        "name": "Мардонов Даврон Ҳамроқулович",
        "birth_year": 1982,
        "birth_place": "Навоий вилояти, Нурота тумани",
        "nationality": "Ўзбек",
        "education": {
            "degree": "Олий",
            "year": 2007,
            "institution": "Самарқанд Давлат архитектура қурилиш институти",
            "major": "Иқтисод"
        },
        "population": {
            "total": 3030,
            "family": 680,
            "household": 575
        },
        "contact": "97-322-00-92"
    },{
        "id": 231,
        "mahalla": "Миришкор",
        "name": "Тойиров Жамшиджон Тошназарович",
        "birth_year": 1980,
        "birth_place": "Навоий вилояти, Нурота тумани",
        "nationality": "Ўзбек",
        "education": {
            "degree": "Олий",
            "year": 2002,
            "institution": "Самарқанд Давлат архитектура қурилиш институти",
            "major": "Қурилиш"
        },
        "population": {
            "total": 2276,
            "family": 581,
            "household": 520
        },
        "contact": "97-368-23-68"
    },{
        "id": 232,
        "mahalla": "Бўдиқ",
        "name": "Эгамов Суннатбек Хамидович",
        "birth_year": 1982,
        "birth_place": "Навоий вилояти, Нурота тумани",
        "nationality": "Ўзбек",
        "education": {
            "degree": "Олий",
            "year": 2008,
            "institution": "Навоий давлат кончилик институти",
            "major": "Электро энергетика"
        },
        "population": {
            "total": 2736,
            "family": 605,
            "household": 405
        },
        "contact": "94-228-85-81"
    },{
        "id": 233,
        "mahalla": "Алишер Навоий",
        "name": "Иботов Шокир Очилович",
        "birth_year": 1966,
        "birth_place": "Навоий вилояти, Нурота тумани",
        "nationality": "Ўзбек",
        "education": {
            "degree": "Олий",
            "year": 1991,
            "institution": "Тошкент енгил саноат институти",
            "major": "Инженер технолог"
        },
        "population": {
            "total": 1300,
            "family": 465,
            "household": 233
        },
        "contact": "99-707-84-57"
    },{
        "id": 234,
        "mahalla": "Шахристон",
        "name": "Каримов Шавкат Икромович",
        "birth_year": 1967,
        "birth_place": "Навоий вилояти, Нурота тумани",
        "nationality": "Ўзбек",
        "education": {
            "degree": "Олий",
            "year": 1990,
            "institution": "Тошкент давлат маданият институти",
            "major": "Ҳаваскорлик халқ мусиқаси ансанблининг раҳбари"
        },
        "population": {
            "total": 1502,
            "family": 512,
            "household": 255
        },
        "contact": "93-660-67-19"
    },{
        "id": 235,
        "mahalla": "Нурфахр",
        "name": "Уроқов Азим Ахатович",
        "birth_year": 1989,
        "birth_place": "Навоий вилояти, Нурота тумани",
        "nationality": "Ўзбек",
        "education": {
            "degree": "Олий",
            "year": 2014,
            "institution": "Навоий давлат педагогика институти",
            "major": "Миллий ғоя"
        },
        "population": {
            "total": 4506,
            "family": 1350,
            "household": 927
        },
        "contact": "94-485-81-89"
    },{
        "id": 236,
        "mahalla": "Янгиҳаёт",
        "ame": "Содиқов Сирожиддин Нурқулович",
        "birth_year": 1978,
        "birth_place": "Навоий вилояти, Нурота тумани",
        "nationality": "Ўзбек",
        "education": {
            "degree": "Олий",
            "year": 2001,
            "institution": "Навоий Давлат педагогика институти",
            "major": "Математика фани ўқитувчиси"
        },
        "population": {
            "total": 4625,
            "family": 1137,
            "household": 793
        },
        "contact": "93-436-78-78"
    },{
        "id": 237,
        "mahalla": "Нуробод",
        "name": "Эшмуродов Беҳзод Бекмуродович",
        "birth_year": 1988,
        "birth_place": "Навоий вилояти, Нурота тумани",
        "nationality": "Ўзбек",
        "education": {
            "degree": "Олий",
            "year": 2013,
            "institution": "Самарқанд қишлоқ хўжалиги институти",
            "major": "Фемерлар хўжалиги бошқариш"
        },
        "population": {
            "total": 2457,
            "family": 665,
            "household": 655
        },
        "contact": "99-178-00-75"
    },{
        "id": 238,
        "mahalla": "Ибн Сино",
        "name": "Ибрагимов Алишер Анварович",
        "birth_year": 1984,
        "birth_place": "Нурота тумани",
        "nationality": "Ўзбек",
        "education": {
            "degree": "Олий",
            "year": 2007,
            "institution": "Жиззах Давлат педагогика институти",
            "major": "Физика ва астирономия"
        },
        "population": {
            "total": 2891,
            "family": 740,
            "household": 553
        },
        "contact": "93-462-19-18"
    }
]

tomdi_tumani = [
    {
        "id": 239,
        "mahalla": "Томдибулоқ ОФЙ",
        "name": "Кулманов Алимхан Темирханович",
        "birth_year": 1986,
        "birth_place": "Навоий вилояти, Томди тумани",
        "nationality": "Қозоқ",
        "education": {
            "degree": "Тугалланмаган олий",
            "year": 2022,
            "institution": "Навоий давлат педагогика институти",
            "major": "Ижтимоий иш"
        },
        "population": {
            "total": 2574,
            "family": 808,
            "household": 589
        },
        "contact": "99-318-68-86"
    },
    {
        "id": 240,
        "mahalla": "Шарқ ОФЙ",
        "name": "Туякбаев Шайкислам Ахметович",
        "birth_year": 1967,
        "birth_place": "Навоий вилояти, Томди тумани",
        "nationality": "Қозоқ",
        "education": {
            "degree": "Ўрта-махсус",
            "year": 1991,
            "institution": "Тошкент Сергели техникуми",
            "major": "фермер хўжалиги"
        },
        "population": {
            "total": 2574,
            "family": 695,
            "household": 570
        },
        "contact": "93-462-87-78"
    },
    {
        "id": 241,
        "mahalla": "Ақтов ОФЙ",
        "name": "Бактибаев Ахмет Мажитович",
        "birth_year": 1963,
        "birth_place": "Навоий вилояти, Томди тумани",
        "nationality": "Қозоқ",
        "education": {
            "degree": "Олий",
            "year": 1990,
            "institution": "Самарқанд Қишлоқ хўжалик институти",
            "major": "Зооинженер-қоракўлшунос"
        },
        "population": {
            "total": 590,
            "family": 132,
            "household": 177
        },
        "contact": "99-223-25-10"
    },
    {
        "id": 242,
        "mahalla": "Сукетти ОФЙ",
        "name": "Турмаханов Жанибек Мусилимович",
        "birth_year": 1985,
        "birth_place": "Навоий вилояти, Томди тумани",
        "nationality": "Қозоқ",
        "education": {
            "degree": "Олий",
            "year": 2007,
            "institution": "Навоий давлат педагогика институти",
            "major": "математика фани ўқитувчиси"
        },
        "population": {
            "total": 491,
            "family": 122,
            "household": 108
        },
        "contact": "99-952-28-85"
    },
    {
        "id": 243,
        "mahalla": "Кериз ОФЙ",
        "name": "Бисенов Гали Молдахметович",
        "birth_year": 1979,
        "birth_place": "Навоий вилояти, Томди тумани",
        "nationality": "Қозоқ",
        "education": {
            "degree": "Тугалланмаган олий",
            "year": 2022,
            "institution": "Навоий давлат педагогика институти",
            "major": "Ижтимоий иш"
        },
        "population": {
            "total": 480,
            "family": 133,
            "household": 99
        },
        "contact": "95-610-81-79"
    },
    {
        "id": 244,
        "mahalla": "Керегетов ОФЙ",
        "name": "Алданов Елибай Тоқбергенович",
        "birth_year": 1963,
        "birth_place": "Навоий вилояти, Томди тумани",
        "nationality": "Қорақалпоқ",
        "education": {
            "degree": "Ўрта-махсус",
            "year": 1994,
            "institution": "Нукус селхозтехникум",
            "major": "хисобчи"
        },
        "population": {
            "total": 925,
            "family": 261,
            "household": 185
        },
        "contact": "95-607-90-96"
    },
    {
        "id": 245,
        "mahalla": "Шиели ОФЙ",
        "name": "Капашов Маутан Бегейович",
        "birth_year": 1974,
        "birth_place": "Навоий вилояти, Конимех тумани",
        "nationality": "Қозоқ",
        "education": {
            "degree": "Ўрта махсус",
            "year": 1997,
            "institution": "Томди тумани бизнес мактаби",
            "major": "ҳисобчи"
        },
        "population": {
            "total": 904,
            "family": 248,
            "household": 187
        },
        "contact": "95-364-74-75"
    },
    {
        "id": 246,
        "mahalla": "Аяққудуқ ОФЙ",
        "name": "Жапбаров Акназар Есенгелдиевич",
        "birth_year": 1973,
        "birth_place": "Навоий вилояти, Томди тумани, Қорақалпоқ",
        "nationality": "Қозоқ",
        "education": {
            "degree": "Тугалланмаган олий",
            "year": 2022,
            "institution": "Навоий давлат педагогика институти",
            "major": "Ижтимоий иш"
        },
        "population": {
            "total": 1873,
            "family": 565,
            "household": 392
        },
        "contact": "93-460-78-73"
    }
]

uchquduq_tumani = [
    {
        "id": 247,
        "sequence": 81,
        "mahalla": "Алтинтау ОФЙ",
        "person": {
            "full_name": "Юсупов Сейт Келичович",
            "birth_year": 1981,
            "birth_place": "Навоий вилояти, Учқудуқ тумани",
            "nationality": "Қозоқ"
        },
        "education": {
            "degree": "Ўрта-маҳсус",
            "year": 2021,
            "institution": "Учқудуқ туман Саноат техникуми",
            "major": "геология қидирувчи муҳандис"
        },
        "population": {
            "total": 642,
            "family": 180,
            "household": 134
        },
        "contact": "95-607-81-51"
    },
    {
        "id": 248,
        "sequence": 82,
        "mahalla": "Дўстлик МФЙ",
        "person": {
            "full_name": "Махаматова Гулноз Усмонқуловна",
            "birth_year": 1979,
            "birth_place": "Самарқанд вилояти, Нарпай тумани",
            "nationality": "Ўзбек"
        },
        "education": {
            "degree": "Олий",
            "year": 1999,
            "institution": "Самарқанд озиқ-овқат техникуми Самарқанд Давлат Университети",
            "major": "ҳуқуқшунослик"
        },
        "population": {
            "total": 7950,
            "family": 2360,
            "household": 1885
        },
        "contact": "93-460-73-37"
    },
    {
        "id": 249,
        "sequence": 83,
        "mahalla": "Мингбулоқ ОФЙ",
        "person": {
            "full_name": "Кузенбаев Бекарис Акмурзаевич",
            "birth_year": 1987,
            "birth_place": "Навоий вилояти, Учқудуқ тумани",
            "nationality": "Қозоқ"
        },
        "education": {
            "degree": "Олий",
            "year": 2003,
            "institution": "Навоий Давлат Педагогика Институти",
            "major": "математика-информатика ўқитувчиси"
        },
        "population": {
            "total": 439,
            "family": 131,
            "household": 100
        },
        "contact": "93-430-27-25"
    },
    {
        "id": 250,
        "sequence": 84,
        "mahalla": "Узунқудуқ ОФЙ",
        "person": {
            "full_name": "Жанаев Тажидаулет Уринбасарович",
            "birth_year": 1984,
            "birth_place": "Навоий вилояти, Учқудуқ тумани",
            "nationality": "Қозоқ"
        },
        "education": {
            "degree": "Олий",
            "year": 2007,
            "institution": "Навоий Давлат педагогика институти (кундузги)",
            "major": "математика-информатика ўқитувчиси"
        },
        "population": {
            "total": 556,
            "family": 128,
            "household": 121
        },
        "contact": "95-607-89-13"
    },
    {
        "id": 251,
        "sequence": 85,
        "mahalla": "Абай МФЙ",
        "person": {
            "full_name": "Алимбаев Саламат Асанханович",
            "birth_year": 1963,
            "birth_place": "Навоий вилояти, Томди тумани",
            "nationality": "Қозоқ"
        },
        "education": {
            "degree": "Олий",
            "year": 1985,
            "institution": "Қозоқ Давлат Педагогика Институти",
            "major": "қозоқ тили ва адабиёти ўқитувчиси"
        },
        "population": {
            "total": 6780,
            "family": 1939,
            "household": 1754
        },
        "contact": "93-310-51-63"
    },
    {
        "id": 252,
        "sequence": 86,
        "mahalla": "Боздун ОФЙ",
        "person": {
            "full_name": "Қаюпов Сахибек Елемесович",
            "birth_year": 1963,
            "birth_place": "Навоий вилояти, Томди тумани",
            "nationality": "Қозоқ"
        },
        "education": {
            "degree": "Олий",
            "year": 1985,
            "institution": "Самарқанд қишлоқ хўжалиги институти",
            "major": "зоотехник"
        },
        "population": {
            "total": 175,
            "family": 42,
            "household": 38
        },
        "contact": "99-752-45-61"
    },
    {
        "id": 253,
        "sequence": 87,
        "mahalla": "Кокпатас МФЙ",
        "person": {
            "full_name": "Жумаев Хасан Хайдарович",
            "birth_year": 1980,
            "birth_place": "Навоий вилояти, Навбахор тумани",
            "nationality": "Ўзбек"
        },
        "education": {
                        "degree": "Олий",
            "year": 2005,
            "institution": "Навоий Давлат Педагогика Иститути",
            "major": "инглиз тили ўқитувчиси"
        },
        "population": {
            "total": 960,
            "family": 230,
            "household": 223
        },
        "contact": "97-367-16-00"
    },
    {
        "id": 254,
        "sequence": 88,
        "mahalla": "Кўкаяз ОФЙ",
        "person": {
            "full_name": "Жалғасбаев Айтуар Нурханович",
            "birth_year": 1969,
            "birth_place": "Навоий вилояти, Томди тумани",
            "nationality": "Қозоқ"
        },
        "education": {
            "degree": "Ўрта-махсус",
            "year": 1993,
            "institution": "Каттақурғон педагогика билим юрти",
            "major": "чизмачилик фани ўқитувчиси"
        },
        "population": {
            "total": 66,
            "family": 14,
            "household": 14
        },
        "contact": "99-168-20-69"
    },
    {
        "id": 255,
        "sequence": 89,
        "mahalla": "Навоий МФЙ",
        "person": {
            "full_name": "Қурбонова Умида Ибодуллаевна",
            "birth_year": 1982,
            "birth_place": "Навоий вилояти, Хатирчи тумани",
            "nationality": "Ўзбек"
        },
        "education": {
            "degree": "Олий",
            "year": 2004,
            "institution": "Навоий Давлат педагогика институти",
            "major": "география фани ўқитувчиси"
        },
        "population": {
            "total": 6247,
            "family": 1845,
            "household": 1734
        },
        "contact": "93-315-40-56"
    },
    {
        "id": 256,
        "sequence": 90,
        "mahalla": "Йўлчилар ОФЙ",
        "person": {
            "full_name": "Алпамисов Жани Садуақасович",
            "birth_year": 1977,
            "birth_place": "Навоий вилояти, Учқудуқ тумани",
            "nationality": "Қозоқ"
        },
        "education": {
            "degree": "Олий",
            "year": 2011,
            "institution": "Навоий маъданият санъат коллежи Чимкент Мухтор Авезов Университети",
            "major": "режиссура"
        },
        "population": {
            "total": 4786,
            "family": 1106,
            "household": 1043
        },
        "contact": "94-372-00-99"
    },
    {
        "id": 257,
        "sequence": 91,
        "mahalla": "Ифтихор МФЙ",
        "education": {
            "degree": "Олий",
            "year": 2008,
            "institution": "Бухоро Давлат Педагогика Институти",
            "major": "истиқлол ғояси, ғояси маънавият асослари"
        },
        "population": {
            "total": 2234,
            "family": 597,
            "household": 522
        },
        "contact": "94-253-27-87"
    },
    {
        "id": 258,
        "sequence": 92,
        "mahalla": "Мустақиллик МФЙ",
        "person": {
            "full_name": "Турдиев Комил Мардонович",
            "birth_year": 1963,
            "birth_place": "Самарқанд вилояти, Пахтачи тумани",
            "nationality": "Ўзбек"
        },
        "education": {
            "degree": "Олий",
            "year": 2008,
            "institution": "Навоий Давлат Педагогика Институти (сиртқи)",
            "major": "миллий истиқлол ғояси, ғояси маънавият асослари"
        },
        "population": {
            "total": 5148,
            "family": 1603,
            "household": 1488
        },
        "contact": "94-377-88-09"
    },
    {
        "id": 259,
        "sequence": 93,
        "mahalla": "Айтим МФЙ",
        "person": {
            "full_name": "Ҳамидов Акбар Обидович",
            "birth_year": 1979,
            "birth_place": "Бухоро вилояти, Вопкент тумани",
            "nationality": "Ўзбек"
        },
        "education": {
            "degree": "Олий",
            "year": 2021,
            "institution": "Навоий Давлат Педагогика Институти",
            "major": "технолог таьлим"
        },
        "population": {
            "total": 5710,
            "family": 1555,
            "household": 1533
        },
        "contact": "94-480-08-21"
    },
    {
        "id": 260,
        "sequence": 94,
        "mahalla": "Шалхар ОФЙ",
        "person":{
            "full_name": "Нарчаев Кенес Садиевич",
            "birth_year": 1984,
            "birth_place": "Бухоро вилояти, Рометан тумани",
            "nationality": "Қозоқ"
        },
        "education": {
            "degree": "Олий",
            "year": 1984,
            "institution": "Алмата Қишлоқ Хўжалиги Университети (кундузги)",
            "major": "ҳисобчи"
        },
        "population": {
            "total": 1488,
            "family": 351,
            "household": 322
        },
        "contact": "99-108-22-07"
    }
]

xaturchi_tumani = [
    {
        'id':261,
        "Туман": "Хатирчи",
        "MFY": "Авоқли МФЙ",
        "Фамилия": "АБДИҒАНИЕВ",
        "Имя": "Жаҳонгир",
        "Отчество": "Абдиғаниевич",
        "Дата рождения": "03.04.1985 йил",
        "Место рождения": "Навоий вилояти, Хатирчи тумани",
        "Национальность": "Ўзбек",
        "Образование": "Олий",
        "Место образования": "2008 й. Тошкент давлат аграр институти, фермер хўжалигини бошқариш ва ташкил этиш",
        "Численность населения": 3455,
        "Количество семей": 778,
        "Количество жилых домов": 703,
        "Телефоны": ["94-222-48-78", "79-545-88-79"]
    },{
        'id': 262,
        "Туман": "Хатирчи",
        "MFY": "Боғчакалон МФЙ",
        "Фамилия": "ЮЛДОШЕВ",
        "Имя": "Нодирбек",
        "Отчество": "Тўйназарович",
        "Дата рождения": "23.07.1974 йил",
        "Место рождения": "Навоий вилояти, Хатирчи тумани Боғчакалон",
        "Национальность": "Ўзбек",
        "Образование": "Олий",
        "Место образования": "1996 й. Жиззах политехника институти, муҳандис-қурувчи",
        "Численность населения": 3197,
        "Количество семей": 654,
        "Количество жилых домов": 625,
        "Телефон": "93-311-72-06"
    },{
        'id': 263,
        "Туман": "Хатирчи",
        "MFY": "Зарафшон МФЙ",
        "Фамилия": "РАСУЛОВ",
        "Имя": "Бекзод",
        "Отчество": "Тоштемирович",
        "Дата рождения": "06.041986 йил",
        "Место рождения": "Навоий вилояти, Хатирчи тумани",
        "Национальность": "Ўзбек",
        "Образование": "Олий",
        "Место образования": "2010 й. Навоий Давлат педагогика институти, миллий истиқлол ғояси, ҳуқуқ ва маънавият асослари",
        "Численность населения": 2467,
        "Количество семей": 585,
        "Количество жилых домов": 507,
        "Телефон": "93-276-37-67"
    },{
        'id':264,
        "Туман": "Хатирчи",
        "MFY": "Икром Карвон МФЙ",
        "Фамилия": "ОЧИЛОВ",
        "Имя": "Қосим",
        "Отчество": "Норқулович",
        "Дата рождения": "16.04.1968 йил",
        "Место рождения": "Навоий вилояти, Хатирчи тумани",
        "Национальность": "Ўзбек",
        "Образование": "Олий",
        "Место образования": "1992 й. Самарқанд давлат қишлоқ хўжалиги институти, инженер",
        "Численность населения": 2864,
        "Количество семей": 612,
        "Количество жилых домов": 534,
        "Телефон": "93-955-73-73"
    },{
        'id':265,
        "Туман": "Хатирчи",
        "MFY": "Истиқлол МФЙ",
        "Фамилия": "ШЕРНАЗАРОВ",
        "Имя": "Баҳодир",
        "Отчество": "Умарович",
        "Дата рождения": "24.03.1962 йил",
        "Место рождения": "Навоий вилояти, Хатирчи тумани",
        "Национальность": "Ўзбек",
        "Образование": "Ўрта махсус",
        "Место образования": "1988 йил, Самарқанд қишлоқ хўжалиги техникуми, аграном",
        "Численность населения": 2872,
        "Количество семей": 695,
        "Количество жилых домов": 661,
        "Телефон": "94-487-43-10"
    },{
        'id':266,
        "Туман": "Хатирчи",
        "MFY": "Кўксарой МФЙ",
        "Фамилия": "МИРЗАЕВ",
        "Имя": "Илҳом",
        "Отчество": "Суюндикович",
        "Дата рождения": "05.07.1968 йил",
        "Место рождения": "Навоий вилояти, Хатирчи тумани",
        "Национальность": "Ўзбек",
        "Образование": "Ўрта махсус",
        "Место образования": "1991 йил, Самарқанд индустриал техникуми, металга ишлов бериш.",
        "Численность населения": 3104,
        "Количество семей": 736,
        "Количество жилых домов": 593,
        "Телефоны": ["99-777-79-72", "93-435-77-67"]
    },{
        'id':267,
        "Туман": "Хатирчи",
        "MFY": "Наврўз МФЙ",
        "Фамилия": "БОЙЖОНОВ",
        "Имя": "Мардон",
        "Отчество": "Меҳирович",
        "Дата рождения": "10.04.1969 йил",
        "Место рождения": "Навоий вилояти, Хатирчи тумани",
        "Национальность": "Ўзбек",
        "Образование": "Олий",
        "Место образования": "1991 й. Самарқанд давлат университети, география",
        "Численность населения": 3127,
        "Количество семей": 706,
        "Количество жилых домов": 557,
        "Телефон": "93-312-11-80"
    },{
        'id':268,
        "Туман": "Хатирчи",
        "MFY": "Новжа МФЙ",
        "Фамилия": "ЮСУПОВ",
        "Имя": "Илёс",
        "Отчество": "Ғуломович",
        "Дата рождения": "13.06.1989 йил",
        "Место рождения": "Навоий вилояти, Хатирчи тумани",
        "Национальность": "Ўзбек",
        "Образование": "Олий",
        "Место образования": "2011 й. Навоий давлат педагогика институти, Жисмоний тарбия ва жисмоний маданият",
        "Численность населения": 2171,
        "Количество семей": 520,
        "Количество жилых домов": 410,
        "Телефон": "93-647-13-89"
  },{
        'id':269,
        "Туман": "Хатирчи",
        "MFY": "Парахун МФЙ",
        "Фамилия": "СОЛИЕВА",
        "Имя": "Мархабо",
        "Отчество": "Рахматовна",
        "Дата рождения": "29.11.1967 йил",
        "Место рождения": "Навоий вилояти, Хатирчи тумани",
        "Национальность": "Ўзбек",
        "Образование": "Олий",
        "Место образования": "1990 й. Тошкент Халқ хўжалиги институти, иқтисодчи",
        "Численность населения": 3515,
        "Количество семей": 831,
        "Количество жилых домов": 615,
        "Телефоны": ["94-374-22-62", "79-544-04-46"]
        },{
            'id':270,
            "Туман": "Хатирчи",
            "MFY": "Пахтакор МФЙ",
            "Фамилия": "НАЗАРОВ",
            "Имя": "Нодирқул",
            "Отчество": "Қодирович",
            "Дата рождения": "01.06.1972 йил",
            "Место рождения": "Навоий вилояти, Хатирчи тумани",
            "Национальность": "Ўзбек",
            "Образование": "Олий",
            "Место образования": "1997 й. Бухоро озиқ-овқат ва енгил саноат технологияси институти, қишлоқ хўжалик  маҳсулотларини сақлаш ва қайта ишлаш технологияси",
            "Численность населения": 2880,
            "Количество семей": 627,
            "Количество жилых домов": 501,
            "Телефон": "93-316-65-00"
        },{
        'id':271,
        "Туман": "Хатирчи",
        "MFY": "Полвонота МФЙ",
        "Фамилия": "ИБРАГИМОВ",
        "Имя": "Зариф",
        "Отчество": "Умрзоқович",
        "Дата рождения": "31.12.1987 йил",
        "Место рождения": "Навоий вилояти, Хатирчи тумани",
        "Национальность": "Ўзбек",
        "Образование": "Тугалланмаган олий",
        "Место образования": "2022 й. Навоий давлат педагогика институти, ижтимоий иш",
        "Численность населения": 2681,
        "Количество семей": 615,
        "Количество жилых домов": 510,
        "Телефон": "94-377-33-26"
    },{
        'id':272,
        "Туман": "Хатирчи",
        "MFY": "Самарқанд МФЙ",
        "Фамилия": "СОДИҚОВ",
        "Имя": "Қутлуғжон",
        "Отчество": "Махмудович",
        "Дата рождения": "05.01.1981 йил",
        "Место рождения": "Навоий вилояти, Хатирчи тумани",
        "Национальность": "Ўзбек",
        "Образование": "Олий",
        "Место образования": "2009 й. Бухоро озиқ-овқат ва енгил саноат технологияси институти, иқтисодиёт",
        "Численность населения": 2376,
        "Количество семей": 542,
        "Количество жилых домов": 505,
        "Телефон": ["93-310-37-73", "79-544-20-78"]
    },{
        'id':273,
        "Туман": "Хатирчи",
        "MFY": "Тамабахрин МФЙ",
        "Фамилия": "СОЙИБНАЗАРОВ",
        "Имя": "Рауф",
        "Отчество": "Тошхонович",
        "Дата рождения": "27.12.1979 йил",
        "Место рождения": "Навоий вилояти, Хатирчи тумани",
        "Национальность": "Ўзбек",
        "Образование": "Олий",
        "Место образования": "2003 й. Жиззах давлат педагогика институти, 2008 й. Навоий давлат педагогика институти, тарих, ҳуқуқ фани ўқитувчиси",
        "Численность населения": 2865,
        "Количество семей": 668,
        "Количество жилых домов": 612,
        "Телефон": "94-631-52-90"
    },{
        'id':274,
        "Туман": "Хатирчи",
        "MFY": "Тинчлик МФЙ",
        "Фамилия": "ТУРСУНОВ",
        "Имя": "Акмал",
        "Отчество": "Сайфиддинович",
        "Дата рождения": "06.04.1988 йил",
        "Место рождения": "Навоий вилояти, Хатирчи тумани",
        "Национальность": "Ўзбек",
        "Образование": "Олий",
        "Место образования": "2013 й. Бухоро давлат муҳандислик техника  институти, транспорт воситаларини ишлатиш",
        "Численность населения": 2505,
        "Количество семей": 655,
        "Количество жилых домов": 512,
        "Телефон": "94-221-48-88"
    },{
        'id':275,
        "Туман": "Хатирчи",
        "MFY        ": "Тошқулоқ МФЙ",
        "Фамилия": "ДОНИЁРОВ",
        "Имя": "Ўткир",
        "Отчество": "Муродуллаевич",
        "Дата рождения": "24.02.1978 йил",
        "Место рождения": "Навоий вилояти, Хатирчи тумани",
        "Национальность": "Ўзбек",
        "Образование": "Тугалланмаган олий",
        "Место образования": "2022 й. Навоий давлат педагогика институти, ижтимоий иш",
        "Численность населения": 2726,
        "Количество семей": 598,
        "Количество жилых домов": 514,
        "Телефон": "94-224-03-31"
    },{
        'id':276,
        "Туман": "Хатирчи",
        "MFY": "Хўжақулобод МФЙ",
        "Фамилия": "ИСЛОМОВ",
        "Имя": "Низомжон",
        "Отчество": "Олимович",
        "Дата рождения": "04.11.1984 йил",
        "Место рождения": "Навоий вилояти, Хатирчи тумани",
        "Национальность": "Ўзбек",
        "Образование": "Олий",
        "Место образования": "2008 й. Бухоро озиқ-овқат ва енгил саноат технологияси институти, озиқ-овқат технологияси",
        "Численность населения": 3388,
        "Количество семей": 681,
        "Количество жилых домов": 610,
        "Телефон": "94-254-60-03"
    },{
        'id':277,
        "Туман": "Хатирчи",
        "MFY": "Янги қурилиш МФЙ",
        "Фамилия": "МАВЛОНОВ",
        "Имя": "Бахтиёр",
        "Отчество": "Яхшибоевич",
        "Дата рождения": "15.01.1990 йил",
        "Место рождения": "Навоий вилояти, Хатирчи тумани",
        "Национальность": "Ўзбек",
        "Образование": "Тугалланмаган олий",
        "Место образования": "2021 й. Навоий Давлат педагогика инсититути талабаси, ижтимоий иш",
        "Численность населения": 2935,
        "Количество семей": 595,
        "Количество жилых домов": 512,
        "Телефон": "93-951-22-12"
    },{
        'id':278,
        "Туман": "Хатирчи",
        "MFY": "А.Навоий МФЙ",
        "Фамилия": "УРИНОВ",
        "Имя": "Ибодулла",
        "Отчество": "Исроилович",
        "Дата рождения": "27.10.1982 йил",
        "Место рождения": "Навоий вилояти, Хатирчи тумани",
        "Национальность": "Ўзбек",
        "Образование": "Олий",
        "Место образования": "2006 йил. Самарқанд қишлоқ хўжалиги институти, бухгалтер аудит",
        "Численность населения": 3212,
        "Количество семей": 753,
        "Количество жилых домов": 595,
        "Телефон": ["94-225-50-81", "79-545-41-82"]
    },{
        'id':279,
        "Туман": "Хатирчи",
        "MFY": "Гулистон МФЙ",
        "Фамилия": "САЛОХИДДИНОВ",
        "Имя": "Истамхон",
        "Отчество": "Саидахматович",
        "Дата рождения": "03.01.1976 йил",
        "Место рождения": "Навоий вилояти, Хатирчи тумани",
        "Национальность": "Ўзбек",
        "Образование": "Олий",
        "Место образования": "2004 йил Самарқанд қишлоқ хўжалиги институти, аграном",
        "Численность населения": 3468,
        "Количество семей": 743,
        "Количество жилых домов": 564,
        "Телефон": ["91-309-42-11", "91-160-42-11"]
    },{
        'id':280,
        "Туман": "Хатирчи",
        "MFY": "Дамариқ МФЙ",
        "Фамилия": "ЭРГАШЕВ",
        "Имя": "Музаффар",
        "Отчество": "Эгамбердиевич",
        "Дата рождения": "28.05.1972 йил",
        "Место рождения": "Навоий вилояти, Хатирчи тумани",
        "Национальность": "Ўзбек",
        "Образование": "Тугалланмаган олий",
        "Место образования": "2022 й. Самарқанд ветеринария медицинаси, чорвачилик ва биотехнологиялар университети, қишлоқ хўжалик маҳсулотларини сақлаш ва дастлабки ишлаш технологияси",
        "Численность населения": 3072,
        "Количество семей": 631,
        "Количество жилых домов": 601,
        "Телефон": "99-593-28-72"
    },{
        'id':281,
        "Туман": "Хатирчи",
        "MFY": "Зарбдор МФЙ",
        "Фамилия": "САХАДДИНОВ",
        "Имя": "Бахтиёр",
        "Отчество": "Мухиддинович",
        "Дата рождения": "31.12.1979 йил",
        "Место рождения": "Навоий вилояти, Хатирчи тумани",
        "Национальность": "Ўзбек",
        "Образование": "Тугалланмаган олий",
        "Место образования": "2022 й. Навоий давлат педагогика институти, ижтимоий иш",
        "Численность населения": 2844,
        "Количество семей": 684,
        "Количество жилых домов": 472,
        "Телефон": "93-315-26-79"
    },{
        'id':282,
        "Туман": "Хатирчи",
        "MFY": "Каттасой МФЙ",
        "Фамилия": "ЭСОНОВ",
        "Имя": "Рахим",
        "Отчество": "Эргашевич",
        "Дата рождения": "12.02.1983 йил",
        "Место рождения": "Навоий вилояти, Хатирчи тумани",
        "Национальность": "Ўзбек",
        "Образование": "Тугалланмаган олий",
        "Место образования": "2022 й. Навоий давлат педагогика институти, ижтимоий иш",
        "Численность населения": 2533,
        "Количество семей": 596,
        "Количество жилых домов": 407,
        "Телефон": "99-336-12-83"
    },{
      'id':283,
        "Туман": "Хатирчи",
        "MFY": "Қорача МФЙ",
        "Фамилия": "ҚУРДОШЕВ",
        "Имя": "Рустамжон",
        "Отчество": "Суярқулович",
        "Дата рождения": "07.06.1985 йил",
        "Место рождения": "Навоий вилояти, Хатирчи тумани",
        "Национальность": "Ўзбек",
        "Образование": "Олий",
        "Место образования": "2010 йил, Навоий давлат кончилик институти, Металлург",
        "Численность населения": 3571,
        "Количество семей": 890,
        "Количество жилых домов": 718,
        "Телефон": "93-461-57-71"
    },{
      'id':284,
        "Туман": "Хатирчи",
        "MFY": "Қуччи МФЙ",
        "Фамилия": "ЮЛДОШЕВ",
        "Имя": "Қутбиддин",
        "Отчество": "Шодиевич",
        "Дата рождения": "13.02.1972 йил",
        "Место рождения": "Навоий вилояти, Хатирчи тумани",
        "Национальность": "Ўзбек",
        "Образование": "Олий",
        "Место образования": "2000 й. Навоий давлат кончилик институти, кимёвий технология ва биотехнология",
        "Численность населения": 2602,
        "Количество семей": 597,
        "Количество жилых домов": 416,
        "Телефон": ["93-124-72-07", "79-545-41-23"]
    },{
      'id':285,
        "Туман": "Хатирчи",
        "MFY": "Миёнқол МФЙ",
        "Фамилия": "САЛИМОВ",
        "Имя": "Шавкат",
        "Отчество": "Юсупович",
        "Дата рождения": "30.07.1972 йил",
        "Место рождения": "Навоий вилояти, Хатирчи тумани",
        "Национальность": "Ўзбек",
        "Образование": "Олий",
        "Место образования": "1995 й. Самарқанд давлат университети",
        "Численность населения": 2470,
        "Количество семей": 536,
        "Количество жилых домов": 512,
        "Телефон": "97-367-04-75"
    },{
      'id':286,
        "Туман": "Хатирчи",
        "MFY": "Мустақиллик МФЙ",
        "Фамилия": "ОРТИҚОВ",
        "Имя": "Салоҳиддин",
        "Отчество": "Маҳамматович",
        "Дата рождения": "17.10.1987 йил",
        "Место рождения": "Навоий вилояти, Хатирчи тумани",
        "Национальность": "Ўзбек",
        "Образование": "Олий",
        "Место образования": "2013 й. Тошкент давлат Ахборот технологиялари университети, Ахборот хавфсизлиги",
        "Численность населения": 4428,
        "Количество семей": 891,
        "Количество жилых домов": 748,
        "Телефон": "99-103-58-68"
    },{
      'id':287,
        "Туман": "Хатирчи",
        "MFY": "Найман МФЙ",
        "Фамилия": "ЭРГАШЕВ",
        "Имя": "Хамдам",
        "Отчество": "Рустамович",
        "Дата рождения": "06.04.1981 йил",
        "Место рождения": "Навоий вилояти, Хатирчи тумани",
        "Национальность": "Ўзбек",
        "Образование": "Олий",
        "Место образования": "2006 й. Навоий давлат педагогика институти, тасвирий санъат ва муҳандислик графикаси ўқитувчиси",
        "Численность населения": 3080,
        "Количество семей": 675,
        "Количество жилых домов": 504,
        "Телефон": "93-463-45-02"
    },{
      'id':288,
        "Туман": "Хатирчи",
        "MFY": "Сарой МФЙ",
        "Фамилия": "ОЛИМОВ",
        "Имя": "Нумон",
        "Отчество": "Норбердиевич",
        "Дата рождения": "04.07.1984 йил",
        "Место рождения": "Навоий вилояти, Хатирчи тумани",
        "Национальность": "Ўзбек",
        "Образование": "Олий",
        "Место образования": "2005 й. Самарқанд давлат унверситети, Социолог",
        "Численность населения": 2872,
        "Количество семей": 662,
        "Количество жилых домов": 512,
        "Телефон": "94-945-55-35"
    },{
      'id':289,
        "Туман": "Хатирчи",
        "MFY": "Хўжақўрғон МФЙ",
        "Фамилия": "НОМОЗОВ",
        "Имя": "Акмал",
        "Отчество": "Отақулович",
        "Дата рождения": "21.12.1981 йил",
        "Место рождения": "Навоий вилояти, Хатирчи тумани",
        "Национальность": "Ўзбек",
        "Образование": "Олий",
        "Место образования": "2004 й,  Самарқанд олий ҳарбий автомобил қўмондонлик-мухандислик билим юрти,"
                "Муҳандислик қўшинлари тактик қумондонлиги",
        "Численность населения": 2753,
        "Количество семей": 712,
        "Количество жилых домов": 553,
        "Телефон": "93-998-33-22"
    },{
      'id':290,
        "Туман": "Хатирчи",
        "MFY": "Чангир МФЙ",
        "Фамилия": "МАРДОНОВ",
        "Имя": "Шохрух",
        "Отчество": "Баходир ўғли",
        "Дата рождения": "09.09.1990 йил",
        "Место рождения": "Навоий вилояти, Хатирчи тумани",
        "Национальность": "Ўзбек",
        "Образование": "Олий",
        "Место образования": "2020 йил Самарканд Иктисодиёт ва Сервис институти, иқтисодчи",
        "Численность населения": 2781,
        "Количество семей": 669,
        "Количество жилых домов": 511,
        "Телефон": ["93-316-40-00", "79-545-56-45"]
    },{
      'id':291,
        "Туман": "Хатирчи",
        "MFY": "Янгирабод МФЙ",
        "Фамилия": "ЗИЁТОВ",
        "Имя": "Зиёдулла",
        "Отчество": "Содиқович",
        "Дата рождения": "13.09.1977 йил",
        "Место рождения": "Навоий вилояти, Хатирчи тумани",
        "Национальность": "Ўзбек",
        "Образование": "Олий",
        "Место образования": "2009 йил. Тошкент Молия институти, молиячи",
        "Численность населения": 4033,
        "Количество семей": 1065,
        "Количество жилых домов": 756,
        "Телефон": ["90-620-78-48", "79-544-20-84"]
    }
]

xatirchi_tumani = [ 
    {
        "id": 292,
        "number": 198,
        "region": "Хатирчи тумани",
        "neighborhood": "Амир Темур МФЙ",
        "name": "ХЎЖАНАЗАРОВ Абдурасул Махаматович",
        "dob": "10.08.1984",
        "place_of_birth": "Навоий вилояти, Хатирчи тумани",
        "nationality": "Ўзбек",
        "education_level": "Олий",
        "education_institution": "2006 й. Самарқанд қишлоқ хўжалиги институти",
        "profession": "ветеринария врачи",
        "population": 3482,
        "families": 688,
        "households": 626,
        "phone1": "91-988-46-46",
        "phone2": "79-545-63-71"
    },
    {
        "id": 293,
        "number": 199,
        "region": "Хатирчи тумани",
        "neighborhood": "Бинокор МФЙ",
        "name": "АКБАРОВ Азизжон Бобохонович",
        "dob": "07.08.1982",
        "place_of_birth": "Навоий вилояти, Хатирчи тумани",
        "nationality": "Ўзбек",
        "education_level": "Ўрта махсус",
        "education_institution": "2002 й. Навоий кончилик инситути қошидаги техника коллежи, солиқ ва солиқга тортиш",
        "unfinished_higher_education": "2021 й. Тошкент “PROFI UNIVERSITIY” MCHJ, иқтисодчи",
        "population": 2666,
        "families": 586,
        "households": 512,
        "phone1": "99-455-40-29",
        "phone2": "90-618-40-29"
    },
    {
        "id": 294,
        "number": 200,
        "region": "Хатирчи тумани",
        "neighborhood": "Боғишамол МФЙ",
        "name": "ХОЛИҚОВ Асроржон Рузимуротович",
        "dob": "22.12.1979",
        "place_of_birth": "Навоий вилояти, Хатирчи тумани",
        "nationality": "Ўзбек",
        "education_level": "Олий",
        "education_institution": "1992 йил Самарқанд қишлоқ хўжалиги институти, озиқ-овқат маҳсулотлари технологи",
        "population": 2765,
        "families": 687,
        "households": 564,
        "phone": "99-706-18-88"
    },
    {
        "id": 295,
        "number": 201,
        "region": "Хатирчи тумани",
        "neighborhood": "Бунёдкор МФЙ",
        "name": "ТЎХТАМУРОДОВ Акмал Бобонорович",
        "dob": "18.03.1975",
        "place_of_birth": "Навоий вилояти, Хатирчи тумани",
        "nationality": "Ўзбек",
        "education_level": "Олий",
        "education_institution": "1996 йил, Тожикистон Республикаси Рудакий номли  Очиқ Университети, Менежер",
        "population": 2220,
        "families": 571,
        "households": 405,
        "phone": "94-484-75-99"
    },
    {
        "id": 296,
        "number": 202,
        "region": "Хатирчи тумани",
        "neighborhood": "Галабек МФЙ",
        "name": "ПАРДАЕВ Равшан Юлдошевич",
        "dob": "06.10.1971",
        "place_of_birth": "Навоий вилояти, Хатирчи тумани",
        "nationality": "Ўзбек",
        "education_level": "Тугалланмаган олий",
        "education_institution": "2022 й, Навоий давлат педагогика институти, ижтимоий иш",
        "population": 3428,
        "families": 778,
        "households": 535,
        "phone1": "90-619-85-05",
        "phone2": "94-226-74-52"
    },
    {
        "id": 297,
        "number": 203,
        "region": "Хатирчи тумани",
        "neighborhood": "Деҳқонобод МФЙ",
        "name": "ЖЎРАҚУЛОВ Жаҳонгир Уринович",
        "dob": "24.01.1985",
        "place_of_birth": "Навоий вилояти, Хатирчи тумани",
        "nationality": "Ўзбек",
        "education_level": "Олий",
        "education_institution": "2009 йил, Тошкент давлат педагогика  университети, тарих фани ўқитувчиси",
        "population": 3271,
        "families": 684,
        "households": 544,
        "phone1": "93-577-22-24",
        "phone2": "79-545-51-64"
    },
    {
        "id": 298,
        "number": 204,
        "region": "Хатирчи тумани",
        "neighborhood": "Дўстлик МФЙ",
        "name": "САФАРОВ Одилжон Отақулович",
        "dob": "14.04.1972",
        "place_of_birth": "Навоий вилояти, Хатирчи тумани",
        "nationality": "Ўзбек",
        "education_level": "Олий",
        "education_institution": "2002 й. Ўзбекистон Республикаси ички ишлар вазирлиги академияси, юристпруденция",
        "population": 2464,
        "families": 770,
        "households": 671,
        "phone1": "93-430-80-84",
        "phone2": "93-160-14-72"
    },
    {
        "id": 299,
        "number": 205,
        "region": "Хатирчи тумани",
        "neighborhood": "Жалойир МФЙ",
        "name": "НАЗАРОВ Хусниддин Суюнович",
        "dob": "27.03.1971",
        "place_of_birth": "Навоий вилояти, Хатирчи тумани",
        "nationality": "Ўзбек",
        "education_level": "Олий",
        "education_institution": "1996 йил, Навоий давлат педагогика институти, Жисмоний тарбия ва жисмоний маданият",
        "population": 3152,
        "families": 820,
        "households": 628,
        "phone": "94-257-26-02"
    },
    {
        "id": 300,
        "number": 206,
        "region": "Хатирчи тумани",
        "neighborhood": "Кориз Араб МФЙ",
        "name": "НОРМУРОДОВ Шомурод Самандарович",
        "dob": "22.07.1963",
        "place_of_birth": "Навоий вилояти, Хатирчи тумани",
        "nationality": "Ўзбек",
        "education_level": "Олий",
        "education_institution": "1985 йил, Тошкент давлат педагогика институти, умумтехника фанлари ва меҳнат таълими",
        "population": 2977,
        "families": 658,
        "households": 430,
        "phone": "94-486-29-63"
    },
    {
        "id": 301,
        "number": 207,
        "region": "Хатирчи тумани",
        "neighborhood": "Қўрғонча МФЙ",
        "name": "УСМОНОВ Умар Қодирович",
        "dob": "03.12.1970",
        "place_of_birth": "Навоий вилояти, Хатирчи тумани",
        "nationality": "Ўзбек",
        "education_level": "Олий",
        "education_institution": "1998 йил, Ўзбекистон Республикаси ИИВ ёнғиндан сақлаш олий техника мактаби алоқа ёнғин ва қуриқлаш, хабарловчи воситалар автоматлаштирилган  тизимларни ишлатиш",
        "population": 3194,
        "families": 718,
        "households": 568,
        "phone": "93-047-70-12"
    },
    {
        "id": 302,
        "number": 208,
        "region": "Хатирчи тумани",
        "neighborhood": "М.Улуғбек МФЙ",
        "name": "БЕГАЛИЕВ Ғолибжон Санақулович",
        "dob": "16.07.1985",
        "place_of_birth": "Навоий вилояти, Хатирчи тумани",
        "nationality": "Ўзбек",
        "education_level": "Олий",
        "education_institution": "2008 йил, Самарқанд қишлоқ хўжалиги институти, қишлоқ хўжалигини механизациялаштириш агроинженери",
        "population": 2497,
        "families": 655,
        "households": 504,
        "phone": "94-202-84-50"
    },
    {
        "id": 303,
        "number": 209,
        "region": "Хатирчи тумани",
        "neighborhood": "Маданият МФЙ",
        "name": "ПЎЛАТОВ Ойбек Мустафоевич",
        "dob": "03.08.1975",
        "place_of_birth": "Навоий вилояти, Хатирчи тумани",
        "nationality": "Ўзбек",
        "education_level": "Олий",
        "education_institution": "1998й. Навоий давлат кончилик институти, кончилик иши",
        "population": 2573,
        "families": 713,
        "households": 456,
        "phone": "93-661-58-57"
    },
    {
        "id": 304,
        "number": 210,
        "region": "Хатирчи тумани",
        "neighborhood": "Оқ олтин МФЙ",
        "name": "ФАЙЗУЛЛАЕВ Шахобиддин Абдуллаевич",
        "dob": "06.03.1971",
        "place_of_birth": "Навоий вилояти, Хатирчи тумани",
        "nationality": "Ўзбек",
        "education_level": "Ўрта махсус",
        "education_institution": "1993 й. Сирдарё автомобил йўллари техникуми, ҳуқуқшунос",
        "population": 2881,
        "families": 689,
        "households": 532,
        "phone1": "94-487-55-33",
        "phone2": "79-545-82-23"
    },{
        "id": 305,
        "number": 211,
        "region": "Хатирчи тумани",
        "neighborhood": "Олмазор МФЙ",
        "name": "МАВЛОНОВ Садирдин Очилович",
        "dob": "07.03.1966",
        "place_of_birth": "Навоий вилояти, Хатирчи тумани",
        "nationality": "Ўзбек",
        "education_level": "Тугалланмаган олий",
        "education_institution": "2022 й, Навоий давлат педагогика институти, ижтимоий иш",
        "population": 2278,
        "families": 569,
        "households": 420,
        "phone": "93-955-26-23"
    },
    {
        "id": 306,
        "number": 212,
        "region": "Хатирчи тумани",
        "neighborhood": "Учтепа МФЙ",
        "name": "ШАКАРОВ Зокиржон Тойирович",
        "dob": "23.03.1984",
        "place_of_birth": "Навоий вилояти, Хатирчи тумани",
        "nationality": "Ўзбек",
        "education_level": "Олий",
        "education_institution": "2009 йил, Низомий номидаги Тошкент давлат педагогика университети",
        "population": 2916,
        "families": 642,
        "households": 526,
        "phone": "97-795-35-52"
    },
    {
        "id": 307,
        "number": 213,
        "region": "Хатирчи тумани",
        "neighborhood": "Фаровон МФЙ",
        "name": "ТАНГАТАРОВ Музроф Шодиевич",
        "dob": "12.11.1981",
        "place_of_birth": "Навоий вилояти, Хатирчи тумани",
        "nationality": "Ўзбек",
        "education_level": "Тугалланмаган олий",
        "education_institution": "2022 й, Навоий давлат педагогика институти, ижтимоий иш",
        "population": 1753,
        "families": 616,
        "households": 573,
        "phone": "91-331-55-03"
    },
    {
        "id": 308,
        "number": 214,
        "region": "Хатирчи тумани",
        "neighborhood": "Фидокор МФЙ",
        "name": "МУСТАФОЕВ Бегмурод Эргашевич",
        "dob": "19.10.1989",
        "place_of_birth": "Навоий вилояти, Хатирчи тумани",
        "nationality": "Ўзбек",
        "education_level": "Олий",
        "education_institution": "2012 йил, Низомий номидаги Тошкент давлат педагогика университети, касбий таълим фани ўқитувчиси",
        "population": 2781,
        "families": 646,
        "households": 517,
        "phone": "93-318-00-38"
    },
    {
        "id": 309,
        "number": 215,
        "region": "Хатирчи тумани",
        "neighborhood": "Худдон МФЙ",
        "name": "ЭРГАШЕВ Жамшид Қутбидинович",
        "dob": "03.04.1982",
        "place_of_birth": "Навоий вилояти, Хатирчи тумани",
        "nationality": "Ўзбек",
        "education_level": "Олий",
        "education_institution": "2006 й. Самарқанд қишлоқ хўжалиги институти, иқтисодиёт",
        "population": 3210,
        "families": 787,
        "households": 708,
        "phone1": "94-280-00-01",
        "phone2": "99-755-55-72"
    },
    {
        "id": 310,
        "number": 216,
        "region": "Хатирчи тумани",
        "neighborhood": "Чечак ота МФЙ",
        "name": "ОЧИЛОВ Ўктам Рахматиллаевич",
        "dob": "05.05.1968",
        "place_of_birth": "Навоий вилояти, Хатирчи тумани",
        "nationality": "Ўзбек",
        "education_level": "Ўрта махсус",
        "education_institution": "1989 й. Оқтош безнис мактаби, ҳисобчи",
        "population": 3052,
        "families": 803,
        "households": 577,
        "phone": "99-755-68-05"
    },
    {
        "id": 311,
        "number": 217,
        "region": "Хатирчи тумани",
        "neighborhood": "Ангидон МФЙ",
        "name": "ВОКАНТ",
        "population": 2267,
        "families": 489,
        "households": 381
    },
    {
        "id": 312,
        "number": 218,
        "region": "Хатирчи тумани",
        "neighborhood": "Бахшижар МФЙ",
        "name": "РАХМОНБЕРДИЕВ Азизбек Зарифович",
        "dob": "30.07.1985",
        "place_of_birth": "Навоий вилояти, Хатирчи тумани",
        "nationality": "Ўзбек",
        "education_level": "Олий",
        "education_institution": "2007 й. Низомий номидаги Тошкент давлат педагогика университети, касб таълими, информатика ва ахборот",
        "population": 2910,
        "families": 814,
        "households": 601,
        "phone": "99-151-50-85"
    },
    {
        "id": 313,
        "number": 219,
        "region": "Хатирчи тумани",
        "neighborhood": "Бўғирдоқ МФЙ",
        "name": "ЭШИМОВ Ҳасан Сағдуллаевич",
        "dob": "12.08.1988",
        "place_of_birth": "Навоий вилояти, Хатирчи тумани",
        "nationality": "Ўзбек",
        "education_level": "Олий",
        "education_institution": "2013 й. Ўзбекистон давлат жисмоний тарбия институти, спорт фаолияти – эшкак эшиш",
        "population": 3115,
        "families": 737,
        "households": 543,
        "phone": "90-085-28-77"
    },
    {
        "id": 314,
        "number": 220,
        "region": "Хатирчи тумани",
        "neighborhood": "Қўрғонтепа МФЙ",
        "name": "ШАЙМАТОВ Ибройим Тўхташевич",
        "dob": "30.01.1965",
        "place_of_birth": "Навоий вилояти, Хатирчи тумани",
        "nationality": "Ўзбек",
        "education_level": "Олий",
        "education_institution": "1983 й. Самарқанд давлат кооператив институти, товаршунос",
        "population": 1932,
        "families": 428,
        "households": 334,
        "phone": "99-183-72-81"
    },{
        "id": 315,
        "number": 221,
        "region": "Хатирчи тумани",
        "neighborhood": "Қўшчинор МФЙ",
        "name": "ШЕРМАТОВ Нурмуҳаммад Маматқулович",
        "dob": "03.01.1987",
        "place_of_birth": "Навоий вилояти, Хатирчи тумани",
        "nationality": "Ўзбек",
        "education_level": "Олий",
        "education_institution": "2012 й. Навоий давлат педагогика институти, миллий истиқлол ғояси ҳуқуқ ва маънавият асослари фани ўқитувчиси",
        "population": 3201,
        "families": 744,
        "households": 635,
        "phone": "91-337-08-89"
    },{
        "id": 316,
        "number": 222,
        "region": "Хатирчи тумани",
        "neighborhood": "Лангар МФЙ",
        "name": "МАДАТОВА Онара Джуракуловна",
        "dob": "19.06.1987",
        "place_of_birth": "Навоий вилояти, Хатирчи тумани",
        "nationality": "Ўзбек",
        "education_level": "Ўрта махсус",
        "education_institution": "2006 й. Хатирчи Агроиқтисодиёт коллежи, иқтисодчи ҳуқуқшунос",
        "additional_education": "Тугалланмаган олий, Тошкент “PROFI UNIVERSITY” хусусий университети, педагогика-психология",
        "population": 3010,
        "families": 671,
        "households": 621,
        "phone": "93-951-40-52"
    },{
        "id": 317,
        "number": 223,
        "region": "Хатирчи тумани",
        "neighborhood": "Майдон МФЙ",
        "name": "ЭШНАЗАРОВ Бекзод Эркинович",
        "dob": "11.08.1987",
        "place_of_birth": "Навоий вилояти, Хатирчи тумани",
        "nationality": "Ўзбек",
        "education_level": "Тугалланмаган олий",
        "education_institution": "2022 й. Навоий давлат педагогика институти, ижтимоий иш",
        "population": 1991,
        "families": 515,
        "households": 345,
        "phone": "99-384-37-74"
    },
    {
        "id": 318,
        "number": 224,
        "region": "Хатирчи тумани",
        "neighborhood": "Мирдош МФЙ",
        "name": "ШОИМОВА Навбаҳор Ҳошимовна",
        "dob": "19.03.1970",
        "place_of_birth": "Навоий вилояти, Хатирчи тумани",
        "nationality": "Ўзбек",
        "education_level": "Олий",
        "education_institution": "1993 й. Тошкент давлат педагогика университети, тарих, ҳуқуқ",
        "population": 2427,
        "families": 611,
        "households": 469,
        "phone": "99-570-03-71"
    },
    {
        "id": 319,
        "number": 225,
        "region": "Хатирчи тумани",
        "neighborhood": "Навбаҳор МФЙ",
        "name": "РАДЖАБОВ Шокир Фазлиддинович",
        "dob": "17.11.1980",
        "place_of_birth": "Навоий вилояти, Хатирчи тумани",
        "nationality": "Ўзбек",
        "education_level": "Ўрта махсус",
        "education_institution": "1999 й. Тошкент шаҳар ҳуқуқшунослик коллежи, ҳуқуқшунос",
        "population": 2987,
        "families": 617,
        "households": 551,
        "phone": "99-755-39-96"
    },
    {
        "id": 320,
        "number": 226,
        "region": "Хатирчи тумани",
        "neighborhood": "Оқтепа МФЙ",
        "name": "ҚАНОАТОВ Баҳодир Абдуахатович",
        "dob": "01.05.1962",
        "place_of_birth": "Навоий вилояти, Хатирчи тумани",
        "nationality": "Ўзбек",
        "education_level": "Олий",
        "education_institution": "1984 й. Самарқанд қишлоқ хўжалиги институти, зооинженер-қоракўлшунос",
        "population": 1842,
        "families": 395,
        "households": 306,
        "phone": "99-660-68-51"
    },
    {
        "id": 321,
        "number": 227,
        "region": "Хатирчи тумани",
        "neighborhood": "Олтинобод МФЙ",
        "name": "ТУРСУНОВ Одилжон Сайдиёрович",
        "dob": "24.12.1983",
        "place_of_birth": "Навоий вилояти, Хатирчи тумани",
        "nationality": "Ўзбек",
        "education_level": "Олий",
        "education_institution": "2005 й. Самарқанд олий ҳарбий билим юрти, артеллерия гуруҳи командири",
        "population": 3447,
        "families": 738,
        "households": 632,
        "phone1": "94-530-76-26",
        "phone2": "97-668-76-26"
    },
    {
        "id": 322,
        "number": 228,
        "region": "Хатирчи тумани",
        "neighborhood": "Олтинсой МФЙ",
        "name": "НУРМАТОВ Бекзод Мамаёқубович",
        "dob": "23.08.1985",
        "place_of_birth": "Навоий вилояти, Хатирчи тумани",
        "nationality": "Ўзбек",
        "education_level": "Олий",
        "education_institution": "2010 й. Тошкент давлат педагогика университети, педагогика-психология",
        "population": 4301,
        "families": 1015,
        "households": 695,
        "phone": "88-377-86-85"
    },{
        "id": 323,
        "number": 229,
        "region": "Хатирчи тумани",
        "neighborhood": "Сангижуман МФЙ",
        "name": "НИЗОМОВ Қосим Насирович",
        "dob": "13.12.1964",
        "place_of_birth": "Навоий вилояти, Хатирчи тумани",
        "nationality": "Ўзбек",
        "education_level": "Олий",
        "education_institution": "1989 й. Самарқанд давлат университети, физик",
        "population": 2345,
        "families": 521,
        "households": 349,
        "phone": "99-121-82-50"
    },{
        "id": 324,
        "number": 230,
        "region": "Хатирчи тумани",
        "neighborhood": "Тасмачи МФЙ",
        "name": "НАЗАРОВ Шахобиддин Ағзамович",
        "dob": "16.08.1984",
        "place_of_birth": "Навоий вилояти, Хатирчи тумани",
        "nationality": "Ўзбек",
        "education_level": "Олий",
        "education_institution": "2008 й. Самарқанд қишлоқ хўжалиги институти, аграномия",
        "population": 4631,
        "families": 1125,
        "households": 785,
        "phone1": "93-318-08-05",
        "phone2": "79-545-44-05"
    },
    {
        "id": 325,
        "number": 231,
        "region": "Хатирчи тумани",
        "neighborhood": "Уйшун МФЙ",
        "name": "ШОНАЗАРОВ Ахмад Шоназарович",
        "dob": "04.06.1986",
        "place_of_birth": "Навоий вилояти, Хатирчи тумани",
        "nationality": "Ўзбек",
        "education_level": "Олий",
        "education_institution": "2010 йил Низомийномидаги Тошкент давлат педагогика университети, география ва иқтисодиётбилимасослари",
        "population": 2582,
        "families": 598,
        "households": 436,
        "phone": "97-797-20-26"
    },
    {
        "id": 326,
        "number": 232,
        "region": "Хатирчи тумани",
        "neighborhood": "Учқора МФЙ",
        "name": "ҚЎЛДОШЕВ Акмал Умирович",
        "dob": "12.02.1986",
        "place_of_birth": "Навоий вилояти, Хатирчи тумани",
        "nationality": "Ўзбек",
        "education_level": "Олий",
        "education_institution": "2012 й. Тошкент автомобил йўллари институти, транспорт воситаларини ишлатиш ва таъмирлаш",
        "population": 4249,
        "families": 905,
        "households": 754,
        "phone": "97-297-88-86"
    },
    {
        "id": 327,
        "number": 233,
        "region": "Хатирчи тумани",
        "neighborhood": "Хонақа МФЙ",
        "name": "ХОЛМУРОДОВ Камолиддин Исмоилович",
        "dob": "01.08.1987",
        "place_of_birth": "Навоий вилояти, Хатирчи тумани",
        "nationality": "Ўзбек",
        "education_level": "Олий",
        "education_institution": "2011. й. Навоий давлат педагогика институти, жисмоний тарбия ва жисмоний маданият",
        "population": 1802,
        "families": 505,
        "households": 331,
        "phone": "90-732-34-44"
    },
    {
        "id": 328,
        "number": 234,
        "region": "Хатирчи тумани",
        "neighborhood": "Чағатой МФЙ",
        "name": "ФАЙЗИЕВ Зохид Мамаюсупович",
        "dob": "21.02.1982",
        "place_of_birth": "Навоий вилояти, Хатирчи тумани",
        "nationality": "Ўзбек",
        "education_level": "Олий",
        "education_institution": "2008. й. Навоий давлат педагогика институти, тарих фани ўқитувчиси",
        "population": 2794,
        "families": 731,
        "households": 545,
        "phone1": "97-668-02-82",
        "phone2": "79-545-46-13"
    },
    {
        "id": 329,
        "number": 235,
        "region": "Хатирчи тумани",
        "neighborhood": "Чинобод МФЙ",
        "name": "ИСКАНДАРОВ Алижон Ишимович",
        "dob": "04.11.1976",
        "place_of_birth": "Навоий вилояти, Хатирчи тумани",
        "nationality": "Ўзбек",
        "education_level": "Олий",
        "education_institution": "2000 й. Навоий давлат кончилик институти, муҳандис-кимёгар технолог",
        "population": 2750,
        "families": 754,
        "households": 528,
        "phone1": "93-664-67-47",
        "phone2": "94-346-67-47",
        "phone3": "79-544-42-16"
    },{
        "id": 330,
        "number": 236,
        "region": "Хатирчи тумани",
        "neighborhood": "Янги МФЙ",
        "name": "НОРОВ Талъант Абдикаримович",
        "dob": "14.05.1979",
        "place_of_birth": "Навоий вилояти, Хатирчи тумани",
        "nationality": "Ўзбек",
        "education_level": "Олий",
        "education_institution": "2007 й. Навоий давлат педагогика институти, жисмоний тарбия ва жисмоний маданият",
        "population": 2866,
        "families": 626,
        "households": 569,
        "phone1": "93-955-80-05",
        "phone2": "79-545-46-73"
    }
]
